[{"_id":{"$oid":"5b5ca4fa7cf0b100209fe498"},"title":"What is arena?","content":"arena's aim is to offer you a convenient platform to organize, run and discuss programming contests. It will be a bit of a social network website, more than a news portal and more than an online judge. Being absolutely independent from me, you will be able to organize and run a contest. And if you're not interested in this, you might discuss the contests world - read/write blogs, discuss topics, and support your dearest and nearest.<br><br>Moreover, I plan to run regular contests according to new and interesting rules. For sure, you will find out, that many important features are missing there. It's because we're still working on it. Be patient, please. I can't promise that I'll be working on the system all the time, but I'll go on working until I find a new team to work on its upcoming features.","tags":["arena"," launch","  firstpost"],"userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2018-07-28T17:16:42.871Z"},"updatedAt":{"$date":"2018-09-29T14:57:51.384Z"},"__v":0},{"_id":{"$oid":"5b6478c558d190002048aab8"},"title":"August Queue 2018","content":"Warm greetings to everyone and welcome to the Codechef Campus Chapter, I am the problem setter for August Queue 2018. The contest will start on 4th August (saturday) at 10 AM and will last for 36 hours (will end on 5th August at 10 PM).<br><br>You will be presented with 3 problems of varying difficulty. Each problem is allotted 100 points. Be careful a Wrong Answer / Time limit Exceeded / Run time Error / Compilation Error will result in 10% negative points ( -10 in this case ).<br>Special thanks to Omkar Prabhu for helping in testing the problems.<br><br>Good luck programmers!","tags":["contest"," Queue"," AUG18"],"userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2018-08-03T15:46:13.427Z"},"updatedAt":{"$date":"2018-08-09T16:24:50.659Z"},"__v":0},{"_id":{"$oid":"5b684c2b9fa4e2002008f85e"},"title":"AUG18 - Report","content":"**Results :**   <br> Congratulations Participants! You have successfully helped the Avengers to defeat the evil. Kudos to our top 5 programmers of [AUG18](\\\"http://siesgstarena.herokuapp.com/contest/AUG18\\\") :<br> 1\\. [sanoop menon](\\\"http://siesgstarena.herokuapp.com/profile/5b659a0c64290b0020a95960\\\")<br> 2\\. [Aditya](\\\"http://siesgstarena.herokuapp.com/profile/5b647a9d58d190002048aab9\\\")<br> 3\\. [Swapnil Satish Shinde](\\\"http://siesgstarena.herokuapp.com/profile/5b6490e95969e7002076f330\\\")<br> 4\\. [Shridhar Ravi](\\\"http://siesgstarena.herokuapp.com/profile/5b66d36591c77d0020b63d0b\\\")<br> 5\\. [Sanket Bailmare](\\\"http://siesgstarena.herokuapp.com/profile/5b66fe9391c77d0020b63d1f\\\") <br><br> **Editorial :**<br> 1: Avengers Unite<br> Run a loop of T test cases. Take 5 string inputs in each. For each string output the corresponding answer on a new line.<br><br> 2: Cibin needs to bunk<br> Check constraints and output 0 in case of N=0. (corner case)<br> Find the number of remaining lectures (n-p-a)<br> Find the minimum lectures Cibin needs to attend (75%) . If the number of lectures are in fraction, round off (ceil) to get the greater integer (as he has to cross 75% if he can't attend exactly 75%) .<br> If the current attendance is more than required, print 0.<br> Else if (required attendance - current attendance) is greater than remaining lectures, print -1.<br> Else print (required attendance - current attendance).<br><br> 3: Doctor Strange to the rescue<br> Take the string input.<br> Iterate the string character by character and print them, If you hit characters r,a,h,u or l, simply don't print it. <br><br> **Coded Solutions:** [Click Here](\\\"https://docs.google.com/document/d/1UQieCumjiTf_Nzh58aV6Al_zl247qoYd1KfG1xT1Y4Y/edit?usp=sharing\\\")<br> (Make sure you use your Siesgst email address)<br> Thank you all for participating! Stay tuned for more contests.","tags":["AUG18"," editorial"," report"," rsd59"],"userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2018-08-06T13:24:59.686Z"},"updatedAt":{"$date":"2018-11-09T16:25:18.666Z"},"__v":0},{"_id":{"$oid":"5b6968d7a82b3600205a0b83"},"title":"Plagiarism & Art of Upsolving","content":"      During the first August Queue this month, me and <a href=\"http://siesgstarena.herokuapp.com/profile/5b5ca6857cf0b100209fe499\">rsd59</a> found few solutions which were copied. In order to keep the sanctity of the platform and to be fair with all the contestants, we came up with following solution:\r\n<b>Participants who are found cheating will be banned from one contest and his/her ratings will be dropped.</b>\r\nWe have added a Plagiarism Checker to track copied solutions. Since no checker can be 100% accurate and efficient, we are trying to achieve a better stage by improving its efficiency.\r\n\r\nThen I realised, its time for the new members to understand and learn the art of reading editorials and upsolving problems. Many a times, contestants leave the problem when they fail to solve it during a contest. In order to improve one's ability, it is very essential to solve the problems which you could not by reading the editorials. Competitive Programmers aim to achieve high ranking in a very short span of time, but we must understand that it takes a lot of effort.","tags":["plagiarism"," cheating"," upsolving"," lesson"],"userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2018-08-07T09:39:35.392Z"},"updatedAt":{"$date":"2019-07-26T13:57:39.697Z"},"__v":0},{"_id":{"$oid":"5b6b2949e514980020065d0d"},"title":"Single Round Match #01","content":"  Warm greetings to everyone and welcome to the Codechef Campus Chapter, I am the problem setter for Single Round Match #01.\r\n\r\nThe contest will start on 11th August (Saturday) at 7 PM and will last for 3 hours (will end on 11th August at 10 PM). The theme of this contest is Old Cartoons. Our team highly thinks that you will have a good time solving the problems while remembering the old cartoons which we all loved :)\r\n\r\nYou will be presented with 3 problems of varying difficulty. The problems are allotted 100-200-250 points. Be careful a Wrong Answer / Time limit Exceeded / Runtime Error / Compilation Error will result in 10% negative points. We do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and the codes will be uploaded after the contest has ended.\r\n\r\nSpecial thanks to Omkar Prabhu and Rahul Sawantdesai for helping in testing the problems. \r\n\r\nGoodluck and godspeed programmers!","tags":["contest"," SRM"," SRM01"],"userId":{"$oid":"5b5d756037392f89933e7514"},"createdAt":{"$date":"2018-08-08T17:32:57.345Z"},"updatedAt":{"$date":"2018-08-10T14:55:07.159Z"},"__v":0},{"_id":{"$oid":"5b6f159e9bb13800202a58a9"},"title":"SRM01 - Report","content":"**Results :**<br> Congratulations Participants! You did a great job in the competition. Kudos to our top 5 programmers of [SRM01](\\\"http://siesgstarena.herokuapp.com/contest/SRM01\\\"):<br><br> 1\\. [Aditya](\\\"http://siesgstarena.herokuapp.com/profile/5b647a9d58d190002048aab9\\\")<br> 2\\. [Pritam Negi](\\\"http://siesgstarena.herokuapp.com/profile/5b5d752b37392f89933e7513\\\")<br> 3\\. [venkhatesh](\\\"http://siesgstarena.herokuapp.com/profile/5b6541b064290b0020a9594a\\\")<br> 4\\. [Vipul Singh Raghuvanshi](\\\"http://siesgstarena.herokuapp.com/profile/5b5d756b37392f89933e7515\\\")<br> 5\\. [Aditya Parthasarathy](\\\"http://siesgstarena.herokuapp.com/profile/5b6c6860746b5e0020a32aa7\\\")<br><br> **Editorial :**<br> 1: Tom vs Jerry<br> Run a loop of T test cases. Take 10 integers as input of an array. Count the number of zeroes and ones in two separate counter variables. Compare the counter variables and print the corresponding output.<br><br> 2: Scooby Doo Is In Danger<br> Run a loop of T test cases. Take a string input in each. Keep separate counter variables for s,c,o,b and y. Iterate the string character by character. If every counter variable has at least 1 occurrence (except o which will have 2) then print yes else print no.<br><br> 3\\. Save Dexter’s Laboratory<br> Take the n integers as input of an array and sort the array. The ith greatest integer and jth smallest integer will have an index of n-i and j-1 in the array. Calculate their difference and print the answer<br><br> **Coded Solutions:** [Click here](\\\"https://docs.google.com/document/d/1F7qnH-ytruOrO_snDroFagZuzuJEgEuTwfQZTD8SPW8/edit?usp=sharing\\\")<br><br> (Make sure you use your Siesgst email address)<br><br> Thank you all for participating! Stay tuned for more contests.","tags":["SRM01","SRM","editorial","report","mandarkotnis"],"userId":{"$oid":"5b5d756037392f89933e7514"},"createdAt":{"$date":"2018-08-11T16:58:06.62Z"},"updatedAt":{"$date":"2018-09-13T13:45:13.851Z"},"__v":0},{"_id":{"$oid":"5b71503a155c0000206d76fd"},"title":"Single Round Match #02","content":" Warm greetings to everyone and welcome to the Codechef Campus Chapter, I am the problem setter for Single Round Match #02.\r\n\r\nThe contest will start on 18th August (Saturday) at 7 PM and will last for 3 hours (will end on 18th August at 10 PM). The theme of this contest is Pritam's Alternate Universe. The problems are based on my daily life experiences and I hope that you will cherish the experiences that I encounter on daily basis.\r\n\r\nYou will be presented with 3 problems of varying difficulty. The problems are allotted 100-200-250 points. Be careful a Wrong Answer / Time limit Exceeded / Runtime Error / Compilation Error will result in 10% negative points. We do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and the codes will be uploaded after the contest has ended.\r\n\r\nSpecial thanks to Omkar Prabhu for helping in testing the problems. \r\n\r\nGoodluck and godspeed programmers!","tags":["SRM"," SRM02"," contest"],"userId":{"$oid":"5b5d752b37392f89933e7513"},"createdAt":{"$date":"2018-08-13T09:32:42.082Z"},"updatedAt":{"$date":"2019-10-07T12:25:28.546Z"},"__v":0},{"_id":{"$oid":"5b783eaee2221500209ac8d7"},"title":"Tragedy of SRM02 (It'll be unrated)","content":"Due to super tight schedule of BUG4EVER and back to back weekly contests and on top of it, due to changes in Compiler's few configurations there were severe bugs raised on the platform.\r\nAlso, due to some uncertain situations of Setter (pritam_negi) and Tester (mine), we didn't proof read the problems and test them twice before the contest.\r\n\r\nProblem A and B both were having small bugs on the setting side because of which users were facing Wrong Answer.\r\nAs the Platform Developer and Contest Admin, I sincerely apologize for the inconvenience caused to the contestants and we will make sure this does not happen again in near future.\r\n\r\n<b>Due to these situations and to make it up, we are keeping the contest SRM02 as Unrated Contest.</b>\r\n\r\nWe hope that this community will understand our situation and we are open to all suggestions and feedback for this contest at: <b>omkar.prabhu15@siesgst.ac.in</b>\r\n","tags":["tragedy"," SRM02"," bugs"," unrated"],"userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2018-08-18T15:43:42.855Z"},"updatedAt":{"$date":"2019-07-08T12:56:52.843Z"},"__v":0},{"_id":{"$oid":"5b784bece2221500209ac8f2"},"title":"SRM02 - Report","content":"**Results :**<br> Congratulations Participants! You did a great job in the competition. Kudos to our top 5 programmers of SRM02:<br> <br> 1\\. [Shridhar Ravi](\\\"http://siesgstarena.herokuapp.com/profile/5b66d36591c77d0020b63d0b\\\")<br> 2\\. [Mandar Milind Kotnis](\\\"http://siesgstarena.herokuapp.com/profile/5b5d756037392f89933e7514\\\")<br> 3\\. [Vipul Singh Raghuvanshi](\\\"http://siesgstarena.herokuapp.com/profile/5b5d756b37392f89933e7515\\\")<br> 4\\. [sanoop menon](\\\"http://siesgstarena.herokuapp.com/profile/5b659a0c64290b0020a95960\\\")<br> 5\\. [Arpita Rane](\\\"http://siesgstarena.herokuapp.com/profile/5b65ac6864290b0020a9596c\\\")<br> <br> **Editorial :**<br> 1\\. Pritam Loves Discount<br> Run a loop of T test cases. Bus Fare for one side of the trip is given to you. Fare for the whole trip will be double of the given price. Just subtract 10% of total amount from the total amount to get the final discounted price.<br> <br> 2\\. Pritam Hates Bus Conductor<br> Just iterate over all the specified ticket fare expressions and those which are calculated wrongly store the corresponding ticket code in an array or vector. Finally display the number of elements stored in the array or vector and all the elements in the array or vector.<br> <br> 3\\. Pritam Likes Cupcakes<br> Collect all squared number in a vector as per constraints in sorted order. Run an optimised binary search for finding a number with minimum difference from N.<br> <br> <br> **Coded Solutions:** [Click here](\\\"https://docs.google.com/document/d/19CMz58w0jLsHIBZMLltDIlrwcnPHJyRpSaw7PNexGhg/edit?usp=sharing\\\")<br> <br> (Make sure you use your Siesgst email address)<br> <br> Thank you all for participating! Stay tuned for more contests.","tags":["SRM02"," SRM"," editorial"," report"," pritamnegi"],"userId":{"$oid":"5b5d752b37392f89933e7513"},"createdAt":{"$date":"2018-08-18T16:40:12.942Z"},"updatedAt":{"$date":"2019-10-07T12:25:31.99Z"},"__v":0},{"_id":{"$oid":"5b8ff646b932db0020c1684f"},"title":"Single Round Match #03","content":"Warm greetings to everyone and welcome to the Codechef Campus Chapter, I am the problem setter for Single Round Match #03.\r\n\r\nThe contest will start on <b>11th September (Tuesday) at 7 PM</b> and will last for <b>3 hours</b>(will end on 11th September at 10 PM). The theme of this contest will be Cognition. The problems will be based on my experiences of Cognition and I hope that you will cherish the same.\r\n\r\nYou will be presented with 3 problems of varying difficulty. The problems are allotted <b>100-200-250</b> points. Be careful a Wrong Answer / Time limit Exceeded / Runtime Error / Compilation Error will result in <b>10% negative points</b>. We do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and solutions will be uploaded after the contest has ended.\r\n\r\nSpecial thanks to Rahul Sawantdesai for helping in testing the problems.\r\n\r\nGoodluck and godspeed programmers!","tags":["SRM","SRM03","contest"],"userId":{"$oid":"5b6490e95969e7002076f330"},"createdAt":{"$date":"2018-09-05T15:29:10.029Z"},"updatedAt":{"$date":"2019-10-07T12:24:45.698Z"},"__v":0},{"_id":{"$oid":"5b97df570570cd0020067f3a"},"title":"Now what happened during SRM03? (Well it was a beta contest!)","content":"   I know we are at our 3rd Single Round Match and all those who participated might have felt something odd in Scoreboard, Status Page as well as your My Submissions Page.\r\n\r\nWell, after working for more than 3 weeks, the site has finally shifted to a New and Strong Core Compiler Resource. Making a whole core compiler transition was not an easy task. \r\nI tried to ensure that tougher problems with more heavy input size ( > 5MB in size) and solutions to those, which should get TLE can be added. (Predict Shambhavi for example).\r\nThis site still runs on free resources as of now and we are trying to serve you as better as we can.\r\nI am working on enhancing and making the status page more functional and also on other set of features to be announced soon.\r\n\r\nWith all that being said, you all know that this is a student driven platform. I am currently looking for students who can help me with this.\r\nAlso we are looking for problem setters for future contests!\r\nPlease shoot an email to <a href=\"mailto:omkar.prabhu15@siesgst.ac.in\">omkar.prabhu15@siesgst.ac.in</a> if you want to work as a Developer on this platform or you want to work as Problem Setter for any future contest.\r\n\r\n<b>Prerequisites for Developer:</b> HTML, CSS, Javascript.\r\n<b>Prerequisites for Problem Setter:</b> Interesting Problem Ideas :)","tags":["SRM"," SRM03"," Change"," Rebuild"," Transition"],"userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2018-09-11T15:29:27.556Z"},"updatedAt":{"$date":"2018-09-11T15:32:48.639Z"},"__v":0},{"_id":{"$oid":"5b97f0bb0570cd0020067f5a"},"title":"SRM03-Report","content":"**Results :**<br> Congratulations Participants! You did a great job in the competition. Kudos to our top 5 programmers of SRM03:<br> <br> 1\\. [Shridhar Ravi](\\\"https://siesgstarena.herokuapp.com/profile/5b66d36591c77d0020b63d0b)<br> 2\\. [Kaustubh Badrike](\\\")<br> 3\\. [Arpita Rane](\\\"https://siesgstarena.herokuapp.com/profile/5b65ac6864290b0020a9596c\\\")<br> 4\\. [Venkatesh murugesh](\\\")<br> 5\\. [Apurva Mhatre<br> ](\\\")<br> <br> **Editorial :**<br> <br> 1\\. Convincing Rahul<br> The simple approach is to try Four possibilities of inserting the operators and output the maximum value as answer there are four possibilities \\\\\"a\\*b\\*c\\\\\",\\\\\"(a\\*b)+c\\\\\",\\\\\"a+(b\\*c)\\\\\",\\\\\"a+b+c\\\\\".Brackets are necessary to follow BODMAS rule .<br> <br> 2\\. Predict Shambhavi<br> The naive approach of solving this problem by traversing the array and decrementing the values by one on each turn gives TLE ( Time Limit Exceeded ) as the computer can perform only 10^9 operations in one second. Looking at the given constraints, maximum value of n being 10^5 and maximum value of W(i) being 10^9, this solution needs 10^14 operations which is infeasible.<br> A faster and smarter approach can be to decrease all the values W(i) and bring the minimum waiting time closer to n, as we know in every traversal all these values get decremented by n. Thus, this solution can solve the problem in less than 10^6 operations, passing the Time Limit.<br> <br> <br> 3\\. Help Shweta to win The Matrix<br> The simple observation one can miss while solving this problem is the example :<br> “zaabcdbc”<br> After deleting “abcd” the string becomes “zabc” ( since the leftmost alpha-ordered string is to be deleted first )<br> After deleting “abc” the answer turns out to be “z”<br> Once you have deduced all the possible cases of this problem. It is easy to manipulate the string by replacing deleted characters with special symbols and ignoring the same in future traversals. Refer the coded solution for detailed manipulation.<br> <br> **Coded Solutions:** [Click here](\\\"https://docs.google.com/document/d/1x1YVHErNzAaCDOfypxX0IQbbbekaVR08d-wZgm9rZow/edit?usp=sharing)<br> <br> (Make sure you use your Siesgst email address)<br> <br> Thank you all for participating! Stay tuned for more contests.","tags":["SRM03","SRM","editorial","report"],"userId":{"$oid":"5b6490e95969e7002076f330"},"createdAt":{"$date":"2018-09-11T16:43:39.053Z"},"updatedAt":{"$date":"2019-10-07T12:25:25.47Z"},"__v":0},{"_id":{"$oid":"5b994c66d8a6990020791b04"},"title":"Feature Set (Latest Updated)","content":"**19-08-2018:**<br> - New Compiler Resource has been added. Testing under progress.<br> <br>\r\n**26-08-2018:**<br> - Search was fixed for finding Users and Blog Posts. You can visit Search [here.](http://arena.siesgst.ac.in/search)<br> <br>\r\n**12-09-2018:**<br> - I have added options for viewing submissions from Status page viz. by Problem, by Output Type and by Language. **Also, there is a change in how Scoreboard will look.** The penalty due to WA/CE/RTE/TLE solutions for problem will be applicable only after getting an AC solution. [REQUESTED FEATURE] <br> <br>\r\n**13-09-2018:**<br> - **Users can try submitting solutions after contest ends and will get a result.** But all the solution codes and results data made after the contest ends, won't be stored in our database. [REQUESTED FEATURE] <br> - **Scoreboard is updated with ICPC style of rankings** where users solving more problems and earliest will be at the top. **Time penalty of 20 minutes** for each unsuccessful attempt will be the difference factor. [REQUESTED FEATURE]<br> - **Upvote & Downvote** options are open for all blog posts.<br> <br>\r\n**16-09-2018:**<br> - Continuing with my Code Sprint, I have finished the section of [Problem Set](http://arena.siesgst.ac.in/problemset). You can solve all the problems after the contest and will get a result.<br> Also you can see the category of the problem in the tags section. It'll help you to focus on specific category, if you want to improve yourself in the same by doing more practice.<br> <br>\r\n**22-09-2018:**<br> - Introducing [Apps](http://arena.siesgst.ac.in/apps). Ideas from community will lead to apps for fun and entertainment. Currently we have **AC Statistics** - Maximum number of AC Submissions by any user in particular language and **Comparator** - Compare performances of any two users of the arena.<br> <br>\r\n**25-09-2018:**<br> - Ratings were reset via Elo Ratings and as per new scoreboard till SRM01. (SEPT18 will be done after plagiarism checker finishes testing)<br> - Ratings Graph on Profile.<br> <br>\r\n**09-11-2018:**<br> - **Comments Feature** under live testing. Also, with upvote/downvote for comments. [REQUESTED FEATURE]<br> <br>\r\n**10-11-2018**<br>- **Markdown** support added for blog posts and comments!<br>\r\n-After the contest ends, users with WA submissions can see expected output and your output. [REQUESTED FEATURE]\r\n<br><br>\r\n**12-11-2018**<br>-Users can now copy input with one button click from example section of the problem :) [REQUESTED FEATURE]\r\n<br>\r\n<br>\r\n**21-12-2018**<br>-Users can now see an indicator on the problem set page showing solved or not solved status for attempted problems :) [REQUESTED FEATURE]\r\n<br>\r\n<br>\r\nPS: I will like to receive feature requests/ideas via comments :)","tags":["features"," developer"],"userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2018-09-12T17:27:02.021Z"},"updatedAt":{"$date":"2019-10-07T12:24:54.37Z"},"__v":0},{"_id":{"$oid":"5b9e10bc21f9cc001fe9216e"},"title":"Tips and Tricks for Java Programmers","content":"Although practice is the only way that ensures increased performance in programming contests but having some tricks up your sleeve ensures an upper edge and fast debugging. First of all, Java is not at all bad for competitive coding. Keeping a few points in mind you can be the best coder in Java :-<br> <br> **Taking Inputs**<br> For taking inputs, Scanner class is a good option but when it comes to efficiency with respect to time, BufferedReader wins the competition. So if you want your code to be time efficient, BufferedReader is the better option.<br> <br> <br> **Collections in Java**<br> A Collection is a group of individual objects represented as a single unit. Java provides Collection Framework which defines several classes and interfaces to represent a group of objects as a single unit.<br> So, the biggest question in your mind is Why Collections?<br> The answer is again related to efficiency. The collections in Java takes less time as compared to arrays.<br> Also there are collections in which duplicates are not allowed, so surely collections can help us in many problems.<br> <br> <br> **Sorting and Searching**<br> Java already have inbuilt methods for sorting and searching, so folks, don't waste your time writing custom methods for searching and sorting.<br> For arrays,<br> We can use Arrays.sort() for sorting the array and also we can use Arrays.binarySearch() for searching an element in an array.<br> For collections,<br> We can use Collections.sort() for sorting any collection and we can use Collections.binarySearch() for searching any element in the collection.<br> _\\--These methods will surely save our time when writing the code._<br> <br> <br> **Some more tricks to ignore TLE verdict**<br> Using bitwise operators also consumes less space and time.<br> For example, when we want to divide a number by 2^k, we have one more option i.e<br> n = n >> k;<br> which will be more efficient than normal whereas when we want to multiply a number by 2^k, we have the better option with us i.e<br> n = n << k;<br> <br> Another example is, finding whether a number is even or odd:<br> System.out.println((a & 1) == 0 ? \\\\\"EVEN\\\\\" : \\\\\"ODD\\\\\" );<br> However, this trick is not that useful but it is sometimes efficient with big numbers.<br> <br> <br> _Note: Don't declare your class public because in many compilers it results in CE/RTE verdict._","tags":["Java"," CP"," SeptemberQueue"," CodingIsLife"],"userId":{"$oid":"5b5d756b37392f89933e7515"},"createdAt":{"$date":"2018-09-16T08:13:48.901Z"},"updatedAt":{"$date":"2019-07-07T08:11:48.956Z"},"__v":0},{"_id":{"$oid":"5b9ea5f17fa8aa001fe32e46"},"title":"Tips and Tricks for C++ Programmers","content":"Let us add some power and speed potions to your coding skills.<br/> CP (Competitive Programming) is not just about problem solving skills, but also about how fast you solve them.<br/> Here are some cool tricks for your upcoming coding battles if you are a C++ programmer.<br/> <br/> <br/> **_\\\\\"With great language, comes great library\\\\\"_** :P<br/> <br/> The Standard C++ Library comes with some cool header files which provide many useful inbuilt functions. Let us look at some of them.<br/> <br/> **1) sort(array,array+size)**<br/> Yes, that's it. Just one line, your passed array is sorted :P<br/> The time complexity of this sorting function is O(nlogn), which means that it can sort arrays upto a size of 10^6 elements!<br/> <br/> Example :<br/> int arr\\[7\\]={3,2,5,2,6,1,4};<br/> sort(arr,arr+7); // sorts the array<br/> <br/> This function is present in the _algorithm_ header file. Make sure you _#include_ this header file before using this function.<br/> <br/> **2) reverse(array,array+size)**<br/> Function : Reverses any array passed to it.<br/> <br/> Example :<br/> char ch\\[5\\]={'l','i','v','e','d'};<br/> reverse(ch,ch+5); // changes \\\\\"lived\\\\\" to \\\\\"devil\\\\\" :P<br/> <br/> Header file : _algorithm_<br/> <br/> **3) max(a,b)**<br/> Function : Compares the two passed integers _a_ and _b_, and returns the maximum one.<br/> Header file : _algorithm_<br/> <br/> **4) min(a,b)**<br/> Function : Compares the two passed integers _a_ and _b_ and returns the minimum one.<br/> Header file : _algorithm_<br/> <br/> **5) \\_\\_gcd(a,b)** _(Note that it begins with two underscores)_<br/> Function : Returns the Greatest Common Divisor of the two passed integers _a_ and _b_.<br/> Header file : _algorithm_<br/> <br/> _Link to some useful string functions_ ? [Click Here](https://www.geeksforgeeks.org/stdstring-class-in-c/) :)<br/> _Link to some useful math functions_ ? [Click Here](https://codescracker.com/cpp/cpp-mathematical-functions.htm) :)<br/> _Link to some more useful functions_ ? [Click Here](https://www.geeksforgeeks.org/c-magicians-stl-algorithms/) :)<br/> Okay Okay enough :P<br/> <br/> **Tip** :<br/> Tired of including too many header files? :P<br/> Just include one single header file in your entire code which includes all the standard, iostream, string, math, algorithm, vector and many more headers:<br/> _bits/stdc++.h_<br/> You will never need to include another header file for CP again.<br/> <br/> Some problems also require some specific Data Structures like Stack, Queue, Vector (Dynammic array), Set, Map, etc. to be solved.<br/> Implementing these data structures can be time consuming, here are some ready-made data structures available in the C++ library :<br/> [Click Here](https://www.geeksforgeeks.org/containers-cpp-stl/)<br/> <br/> <br/> **Macros**<br/> <br/> Saving a default code with pre-defined macros helps you speed up your coding during the contest. (Or if you are too lazy to write too much :P)<br/> Here is a good example :<br/> <br/> #define REP(i,a,b) for(i=a;i<=b;i++)<br/> int main()<br/> {<br/> int a\\[10\\],i,s=0;<br/> REP(i,0,9) cin>>a\\[i\\]; //takes 10 integer inputs<br/> REP(i,0,9) s+=a\\[i\\]; // stores their sum in s<br/> return 0;<br/> }<br/> <br/> _NOTE: Declaring the main function as \\\\\"void\\\\\" or including the conio header file in CP results in Compilation Error._","tags":["C++"," CP"," SeptemberQueue"," tips"," tricks"],"userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2018-09-16T18:50:25.599Z"},"updatedAt":{"$date":"2019-10-07T12:27:22.085Z"},"__v":0},{"_id":{"$oid":"5b9fdc2ced703a001fe14f10"},"title":"Tips and Tricks for Python Programmers","content":"  Diving into the arena, and want to flex your Python muscles? These tips will help you rise up the scoreboard in no time!\r\n\r\n(Note: This post is specific to Python3)\r\n\r\nInput and Output\r\nLook no further than <a href=\"https://docs.python.org/3/library/functions.html#input\">input()</a> for all your input needs. Every call returns a string for a line in the standard input. However, you may need to convert your input to be able to use it in your program.\r\n<a href=\"https://docs.python.org/3/library/functions.html#int\">int</a>(input()) will return a numeric value for your input.\r\ninput().<a href=\"https://docs.python.org/3/library/stdtypes.html#str.split\">split()</a> will return a list (array) of strings, using whitespace as a default delimiter.\r\nSimilarly, <a href=\"https://docs.python.org/3/library/functions.html#print\">print(element1, element2)</a> will suffice all your outputs.The keyword argument ‘sep’ determines what is printed between two arguments, while ‘end’ will help you control newline behaviour, among other things.\r\n\r\nSort and Search\r\nDepending on your needs, you may sort a list in place using <a href=\"https://docs.python.org/3/library/stdtypes.html#list.sort\">list.sort()</a>, or return a new list using <a href=\"https://docs.python.org/3/library/functions.html#sorted\">sorted(list)</a>. (Tip: Read the <a href=\"https://docs.python.org/3/howto/sorting.html\">Sorting guide</a> for advanced sorting techniques such as key functions)\r\nFor searching, use <a href=\"https://docs.python.org/3/library/stdtypes.html#bytes.find\">find(element)</a>, which returns the index of the element if element exists in the list, -1 otherwise.\r\nHowever, if index is trivial, you may use the '<a href = \"https://docs.python.org/3/reference/expressions.html#in\">in</a>' operator. The expression <i>element in list</i> returns True if element is present in the list.\r\n\r\nData Structures\r\nLists are python’s equivalent to arrays, and elements are accessed using numeric indices.\r\nNegative indices are used to access elements from the tail of the list. list[-n] returns the nth element from the end\r\nList[a:b] returns a sublist from index a (incl.) to b (excl.)\r\nDictionaries store data as key:value pairs, and elements are accessed as dict[key]. Keys cannot duplicate in a single dictionary.\r\nUse dict.items() to iterate over a dictionary. Ex.\r\nfor key, value in dict.items():\r\n#your code\r\n\r\nBonus\r\nUse <a href=\"https://docs.python.org/3/library/functions.html#map\">map(function, list)</a> to apply a function to every element in the list. You can iterate over the result in a for loop as:\r\nfor item in map(function, list):\r\n\t#your code\r\nHowever, if you want to access the result using indices, use <a href=\"https://docs.python.org/3/library/functions.html#func-list\">list</a>(map(f,l)).\r\n\r\nThese were some of the tools you may need on future challenges. Delve into <a href=\"https://docs.python.org/3/tutorial/index.html\">the tutorial</a> and <a href=\"https://docs.python.org/3/index.html\">documentation</a> to get a deeper experience of Python magic.\r\n","tags":["Python","SeptemberQueue"],"userId":{"$oid":"5b6c66d6746b5e0020a32aa5"},"createdAt":{"$date":"2018-09-17T16:54:04.692Z"},"updatedAt":{"$date":"2019-10-07T12:26:07.077Z"},"__v":0},{"_id":{"$oid":"5ba3b64996b924001f5afe6d"},"title":"September Queue 2018","content":" Warm greetings to everyone and welcome to the CodeChef Campus Chapter. I am the problem setter for September Queue 2018.\r\n\r\nSit back and relax, for this is a <b>36 hour</b> long contest! The contest will begin on <b>22<sup>nd</sup> September, 2018</b> at <b>10 AM</b> and end on <b>23<sup>rd</sup> September, 2018</b> at <b>10 PM</b>. The contest will be based on the theme of '<b>Festivals</b>'.\r\n\r\nThe contest consists of 5 problems of varying difficulty. Each problem is allotted <b>100 points</b>. With the updated <b>ICPC style of rankings</b>, users solving more problems and earliest will be at the top. Note that there will be a <b>time penalty of 20 minutes</b> for each unsuccessful attempt (Wrong Answer / Compilation Error / Time Limit Exceeded / Run Time Error). \r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and solutions for all the problems will be uploaded after the contest has ended. \r\n\r\nSpecial Thanks to <a href=\"http://siesgstarena.herokuapp.com/profile/5b5ca6857cf0b100209fe499\" target=\"_blank\">Rahul Sawantdesai</a> and <a href=\"http://siesgstarena.herokuapp.com/profile/5b5c89298114180020d4bcb0\" target=\"_blank\">Omkar Prabhu</a> for helping in testing the problems.\r\n\r\nGood luck Programmers! ","tags":["contest"," Queue"," SEPT18"],"userId":{"$oid":"5b66d36591c77d0020b63d0b"},"createdAt":{"$date":"2018-09-20T15:01:29.917Z"},"updatedAt":{"$date":"2019-10-07T12:25:22.522Z"},"__v":0},{"_id":{"$oid":"5ba3c3f496b924001f5afe6e"},"title":"Coding?","content":"The very first step is start, start somewhere! Almost everyone in my age group is allergic to coding, and yet somehow, here we are in CE and IT branch! I started off here at siesgstarena, and am glad I did. Students thinking that they won't be able to compete with 2nd year students or thinking that they do not know at this stage, well you are wrong! Most questions don't require usage of anything special. If you just know basic scanning and printing, for loop and If Else... you are in! There is always someone better than you, and you should be glad for the same since you get to learn more! I always check the editorials but I learn more from submissions of other contestants! Hope to see some major participation for September Queue.\r\n\r\nGood Luck!\r\nSpecial thanks to - Rahul Sawantdesai\r\n                                  Harsh Agrawal\r\n","tags":["Coding"," FE"],"userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2018-09-20T15:59:48.363Z"},"updatedAt":{"$date":"2018-11-09T13:46:53.274Z"},"__v":0},{"_id":{"$oid":"5ba7c4e184a463001f96c670"},"title":"SEPT18 - Report","content":"  <b>Results:</b>\r\nCongratulations Participants! You did a great job in the contest. Kudos to our top 5 programmers of SEPT18:\r\n1. <a href=\"http://siesgstarena.herokuapp.com/profile/5b6c66d6746b5e0020a32aa5\" target=\"_blank\">Kaustubh Badrike</a>\r\n2. <a href=\"http://siesgstarena.herokuapp.com/profile/5b5d756b37392f89933e7515\" target=\"_blank\">Vipul Singh Raghuvanshi</a>\r\n3. <a href=\"http://siesgstarena.herokuapp.com/profile/5b965f807a85c60020f98a6f\" target=\"_blank\">Vignesh Ramachandran</a>\r\n4. <a href=\"http://siesgstarena.herokuapp.com/profile/5b66fe9391c77d0020b63d1f\" target=\"_blank\">Sanket Bailmare</a>\r\n5. <a href=\"http://siesgstarena.herokuapp.com/profile/5b6c6860746b5e0020a32aa7\" target=\"_blank\">Aditya Parthasarathy</a>\r\n\r\n<b>Editorial:</b>\r\n1. Who Will Break the Handi?\r\nFor the given values of A, B & C, we run the loop until C reaches 1. Increment goal count for A if (A%C==0) i.e. C is a factor of A. Decrement A for every goal scored by A. Similarly, increment goal count for B if (B%C==0). Decrement B for every goal scored by B. Compare the goals scored by A & B and print who won.\r\n\r\n2. Shweta and her Rakhi\r\nGiven N distinct integers. Sort them and store them in a new array, say sorted_array. For a given value K, find what is the value at the K<sup>th</sup> position in the original array. Output the index of this value from sorted_array.\r\n\r\n3. Vishal's Journey\r\nThe simplest method is to check all the given conditions. An efficient approach is to check the length of the string first, followed by the condition for the first character (Password should not begin with a number). The remaining conditions can be checked in any way it fits you. \r\n\r\n4. Nishant's Diwali Puzzle\r\nThe first hurdle is accepting the input as the number of elements N is not provided. The easiest way to overcome is to read till the end of the line, i.e until you encounter '\\n'. Next, search for the even sub-sequence. From every such sub-sequence, get the maximum value. Store them in an array. Finally, print the minimum value from this array. If no even terms are present in the sequence, simply print '-1'.\r\n\r\n5. Aarya Celebrates Dussehra\r\nThis problem can be solved using DFS and Sorting the distances calculated from the Source Node. We run DFS from the source node and maintain a list distance for each node. The distance for each node increases via DFS. Remember, once a node is visited we cannot revisit the node. After the traversal, we have to sort the list of node and distances alphabetically which means e.g.:\r\n(A,3), (C,2), (B,1), (F, 1),  (D, 3), (E, 2)\r\nThen sorted result would be\r\n(B,1), (F, 1), (C,2), (E, 2), (A,3), (D,3)\r\nSo answer for this example will be B and D.\r\n\r\n<b>Solutions:</b> <a href=\"https://docs.google.com/document/d/1Ffyz8dKaZ9hD7EVtpFt8h6lPJ_NJANWgGvQX4s0XaGA/edit?usp=sharing\" target=\"_blank\">Click Here</a>\r\n(Note: The solutions are accesible only using GST email addresses)\r\n\r\nThank you, everyone, for participating! Stay tuned for more contests.","tags":["SEPT18"," Queue"," editorial"," report"," shridharravi97"],"userId":{"$oid":"5b66d36591c77d0020b63d0b"},"createdAt":{"$date":"2018-09-23T16:52:49.309Z"},"updatedAt":{"$date":"2019-10-07T12:25:19.626Z"},"__v":0},{"_id":{"$oid":"5ba8ffd9a46767001f02d154"},"title":"Want to become a Problem Setter / Developer ?","content":"  Have some tricky and interesting problem ideas ? Want to test how many people can solve your puzzles ? \r\nWell then you are in the right place !\r\n\r\nWe are looking for <b>Problem Setters</b> for future contests. You will be experiencing everything from writing problem statements, generating test cases to creating solutions and testing the same. \r\n\r\nWe are also looking for <b>Web Developers</b> to work on this platform. You will learn how to work with cloud services, bit of DevOps, frontend and backend in depth.\r\n\r\nFeeling interested ? Please let us know by writing an <b>email to:</b> rahul.sawant17@siesgst.ac.in   ","tags":["Problem Setting"," Web Development"],"userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2018-09-24T15:16:41.722Z"},"updatedAt":{"$date":"2018-11-14T01:30:02.792Z"},"__v":0},{"_id":{"$oid":"5bab07ca2f66c6002136ca04"},"tags":["CCDSAP"," certification"," pritam_negi"],"title":"My CCDSAP Experience","content":"I was in my second year of Engineering course when I was introduced to Competitive Programming by my friends. In the initial stages I wasn't able to guess where should I start from. This is when I got to know about a algorithmic programming certification by Codechef that goes by the name of CCDSAP (Codechef Certified Data Structures and Algorithms Programme).\r\n\r\nBut again I wasn't confident enough to appear for this exam. I would like to thank my friends Omkar Prabhu and Aditya Kulkarni who guided me on how I can crack this. So I started preparing for the exam in my vacations and appeared for it in the month of July. For preparing, I solved the problems in the exact order given in the prepare section of CCDSAP exam (<a href=\"https://www.codechef.com/certification/prepare\">Visit Here</a>).\r\n\r\nAccording to me, this exam helped me gain confidence and strong hold in solving algorithmic challenges. ","userId":{"$oid":"5b5d752b37392f89933e7513"},"createdAt":{"$date":"2018-09-26T04:15:06.604Z"},"updatedAt":{"$date":"2019-10-07T12:26:12.234Z"},"__v":0},{"_id":{"$oid":"5bacf8f9b811e00021373ca0"},"tags":["SRM","SRM04","contest"],"title":"Single Round Match #04","content":"  \r\nWarm greetings to all the <b>coders</b> out there! Welcome to the Codechef Campus Chapter, me and <a href=\"https://siesgstarena.herokuapp.com/profile/5b606d47e228ec0020a1fcf1\">Harsh Sanjay Agrawal</a> will be the problem setters for Single Round Match #04.\r\n\r\nThe contest will commence on 29 September (Saturday) for 3 hours from <b>7:00 PM to 10:00 PM</b>. Theme for this contest is Gaming. The theme itself is enough to give you a gist of how the problems will be. I hope that you will enjoy solving these problems.\r\n\r\nThere will be 3 problems of varying difficulty of <b>100-200-300</b> points respectively. The penalty due to <b>WA/CE/RTE/TLE</b> solutions for problem will be applicable only after getting an <b>AC</b> solution. Scoreboard is updated with <b>ICPC style of rankings</b> where users solving more problems and earliest will be at the top. Time penalty of <b>20 minutes for each</b> unsuccessful attempt will be the difference factor.\r\n\r\n We do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action.\r\n\r\nSpecial thanks to <a href=\"http://siesgstarena.herokuapp.com/profile/5b5ca6857cf0b100209fe499\">Rahul Sawantdesai</a> for helping in testing the problems.\r\n\r\nGoodluck and godspeed programmers! ","userId":{"$oid":"5b607d4fe228ec0020a1fcf2"},"createdAt":{"$date":"2018-09-27T15:36:25.325Z"},"updatedAt":{"$date":"2019-10-07T12:24:57.97Z"},"__v":0},{"_id":{"$oid":"5bafaa5b78d488002197d1ed"},"tags":["SRM04","SRM","editorial","report","Harsh Sanjay Agrawal"],"title":"SRM-04 Report","content":"**Results:**<br> Congratulations Participants! You did a great job in the contest. Kudos to our top 5 programmers of SEPT18:<br> 1.[Aditya Loke](http://siesgstarena.herokuapp.com/profile/5b647a9d58d190002048aab9)<br> 2.[Vipul Singh Raghuvanshi](http://siesgstarena.herokuapp.com/profile/5b5d756b37392f89933e7515)<br> 3.[Kaustubh Badrike](http://siesgstarena.herokuapp.com/profile/5b6c66d6746b5e0020a32aa5)<br> 4.[Mithil Kiran Poojary](http://siesgstarena.herokuapp.com/profile/5b6dcf5ce21df60020be63c4)<br> 5.[Ninad Chavan](http://siesgstarena.herokuapp.com/profile/5b67014c91c77d0020b63d25)<br> <br> **Editorial:**<br> <br> **1\\. Cibin Challenges Harsh**<br> **Prerequisites** : None<br> **Difficulty** : Very easy<br> **Solution type** : Simple math and conditionals<br> For each test case, find the sum of all the trials. Then check if the sum is greater than or less than the minimum points required. Print the difference between the sum of trials and required points if the trial points are less than required points. Print “Harsh Wins” otherwise.<br> <br> **2\\. Chopper Challenge**<br> **Prerequisites** : None<br> **Difficulty** : Easy<br> **Solution type** : String Handling<br> For each case, input needs to be taken till the pointer encounters a “.” The input needs to be converted into numbers, and sorted. Print the index of each number, in order of input taken.<br> <br> **3\\. Ghost game**<br> **Prerequisites** : Binary Search<br> **Difficulty** : Medium<br> **Solution type** : Optimization, Binary Search<br> The given sequence can be modified into a cumulative sequence which denotes the total number of stairs till a particular floor.<br> Now to reach to the floor which has total stairs close to the ones given in the queries, a linear search algorithms fails leaving us with TLE.<br> As max value of N is 10^6 and that of Q is 10^5, the total operations linear search will perform are close to 10^11. While computers can perform only 10^9 operations in 1 second, hence the TLE.<br> If you observe carefully, the sequence once modified into a cumulative sequence is always sorted in increasing order.<br> So we are free to perform Binary Search instead of linear search. This will solve the problem in less than 10^7 operations.<br> <br> <br> **Solutions:** [Click Here](https://docs.google.com/document/d/1eUpKeAkInLAr1QtMcPElC5ZTtdDV_KeHD0mtjhnb7sw/edit?usp=sharing)<br> (Note: The solutions are accessible only using GST email addresses)<br> <br> Thank you, everyone, for participating! Stay tuned for more contests.","userId":{"$oid":"5b606d47e228ec0020a1fcf1"},"createdAt":{"$date":"2018-09-29T16:37:47.365Z"},"updatedAt":{"$date":"2019-10-07T12:25:05.222Z"},"__v":0},{"_id":{"$oid":"5beb2b2221308300218e40f1"},"tags":["c++"," rand()"," test case generator"," input file"],"title":"How to create your own testcase generator?","content":"There was this one question which always haunted me for a long time...\r\nHow do these people manage to test our code vs different test-cases?!? Like so many possibilities with a wide range! With all sorts of characters, integers, etc.\r\nWell, I recently learnt a way to do it and hence I am here to share it with y'all!\r\n\r\nSo, basically we use a function to generate random integers. We can build a random function ourselves by simply writing a random expression and giving a start value (known as seed value) and the function repeats itself with the output as new input. But there are indeed inbuilt functions available for the same! I am a c++ guy, the function here is rand() which returns a random integer! \r\n\r\n``cout <<  rand();`` //this line prints a random number between 0 and 32767\r\n\r\n``cout << (rand() % (max - min + 1)) + min;``//this prints a random number between max and min\r\n\r\nWe also need to pass a seed value in such a way that program generates random numbers on every run. For this we use srand(time(0)); //this gives a seed value based on time at which program is executed.\r\n\r\nThat's all you need! Thanks for reading! :D\r\n\r\nHere is an example code for Avengers Unite problem:\r\n(https://siesgstarena.herokuapp.com/contest/AUG18/problem/AUG18A)\r\n```c++\r\n#include <bits/stdc++.h>\r\nusing namespace std;\r\n\r\nstring cases[5] =\r\n{\r\n    \"light\",\r\n    \"magic\",\r\n    \"strength\",\r\n    \"stealth\",\r\n    \"earth\"\r\n};\r\n\r\nint main()\r\n{\r\n    srand(time(0));\r\n\r\n    int max = 50, min=1;//as our testcase is 1<=t<=50\r\n\r\n    int t =(rand() % (max - min + 1)) + min;\r\n    cout << t << \"\\n\";\r\n    int m;\r\n    while(t--)\r\n    {\r\n        m =(rand() % (4 - 0 + 1)) + 0; //since our array index lies between 0 and 4\r\n        cout << cases[m] << \"\\n\";\r\n    }\r\n}\r\n```","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2018-11-13T19:50:58.569Z"},"updatedAt":{"$date":"2018-12-26T08:21:10.544Z"},"__v":0},{"_id":{"$oid":"5bed469bfbd99d002117d49c"},"tags":["issue-tracking"," developer"," siesgstarena"," github"],"title":"Issue Tracking for SIESGSTarena","content":"Recently, SIESGSTarena's developer team has adopted Continuous Deployment and Integration. We would like you all to report all the platform bugs/features/enhancements for frontend/backend and relevant/irrelevant issues on our GitHub Repository for Issue Tracking.\r\n<br/>\r\nThis will help us to keep a track of all the community issues and ease the pain of tracking issues for our developers.\r\n<br/>\r\nVisit Here: [https://github.com/siesgstarena/arena-issue-tracking](https://github.com/siesgstarena/arena-issue-tracking).\r\n","userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2018-11-15T10:12:44.007Z"},"updatedAt":{"$date":"2018-11-15T21:25:34.475Z"},"__v":0},{"_id":{"$oid":"5c1a0e365b27530021a66b8e"},"tags":["opensource"," projects"," siesgstarena"],"title":"Announcing SIESGSTarena's Open Source Site","content":"At SIESGSTarena, we focus on improving the level of Competitive Programming in the college as well as we engineer applications at an aggressive pace. To do so, the software or tools, we develop as well as use must be simple to understand, production-hardened, and easily accessible. That's why we support open source software. We make use of the best the community has to offer, and contribute our best work back to the community.\r\n\r\nOur Developer Team is excited to announce [SIESGSTarena's Open Source Site](https://siesgstarena.github.io), a page highlighting some of the best softwares and tools available on our public [GitHub page](https://github.com/siesgstarena). We have some exciting projects in the works. And they'll be highlighted here, first.\r\nWe hope that SIESGSTarena's open source software sparks adoption, discussion, contributions and ultimately, an even richer open source community.\r\n\r\nVisit Here: [https://siesgstarena.github.io](https://siesgstarena.github.io)","userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2018-12-19T09:24:06.144Z"},"updatedAt":{"$date":"2018-12-20T09:33:48.546Z"},"__v":0},{"_id":{"$oid":"5c2f5dada6245d0022071a06"},"tags":["SRM05 "," CP "," Networking "," CodingIsLife "," Announcement"],"title":"Single Round Match #05","content":"Warm greetings to everyone and welcome to the Codechef Campus Chapter, I am the problem setter for Single Round Match #05.\r\n\r\nThe contest will start on <b>6th January (Sunday) at 7 PM</b> and will last for <b>3 hours</b> (will end on 6th january at 10 PM). The theme of this contest will be #Networking. The problems will be based on Computer Networks and I hope that you will try your level best to solve them.\r\n\r\nThere will be 3 problems of varying difficulty of <b>100-200-300</b> points respectively. The penalty due to <b>WA/CE/RTE/TLE</b> solutions for problem will be applicable only after getting an <b>AC</b> solution. Scoreboard is updated with <b>ICPC style of rankings</b> where users solving more problems and earliest will be at the top. Time penalty of <b>20 minutes for each</b> unsuccessful attempt will be the difference factor.\r\n\r\n We do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and solutions will be uploaded after the contest has ended.\r\n\r\nSpecial thanks to <a href=\"http://arena.siesgst.ac.in/profile/5b5c89298114180020d4bcb0\">Omkar Prabhu</a> for helping in testing the problems.\r\n\r\nGoodluck and godspeed programmers!","userId":{"$oid":"5b5d756b37392f89933e7515"},"createdAt":{"$date":"2019-01-04T13:20:45.522Z"},"updatedAt":{"$date":"2019-10-07T12:24:41.934Z"},"__v":0},{"_id":{"$oid":"5c322df2a97ba60022317bfe"},"tags":["Report "," Results "," SRM05 "," Networking Rocks "," Editorials "," vipul-08"],"title":"Single Round Match 05 -- Report","content":"<b>Results : </b>\r\nCongratulations Participants! You have successfully helped Cibin to tackle his problem of Computer Networks. Kudos to our top 5 programmers of #SRM05 :\r\n1. Sanoop Menon\r\n2. Aditya Loke\r\n3. Aditya Parthasarathy\r\n4. Kaustubh Badrike\r\n5. Sanket Bailmare\r\n\r\n\r\n\r\nEditorial :\r\n<a href=\"https://github.com/vipul-08/SRM05\">Click Me</a>","userId":{"$oid":"5b5d756b37392f89933e7515"},"createdAt":{"$date":"2019-01-06T16:33:54.196Z"},"updatedAt":{"$date":"2019-10-07T12:24:38.224Z"},"__v":0},{"_id":{"$oid":"5c3610f9ec563500224f5a72"},"tags":["ccdsap"," certification"," dashboard"],"title":"Introducing Codechef Certified Candidates Dashboard","content":"<p>\r\nIt was on 13th December 2018 when Codechef introduced a dedicated dashboard for CCDSAP Certified Candidates. You can access the dashboard <a href=\"https://www.codechef.com/certification/data-structures-and-algorithms/certified-candidates\">here</a>. I was one of the students from SIES Graduate School of Technology who have their names enlisted on this dashboard.\r\n</p>\r\n<p>\r\nThrough this dashboard, Codechef aims at providing better job opportunities to the CCDSAP Certified Candidates by attracting recruiters to this dashboard. Also this platform enables anyone to showcase their skills in an organized manner. \r\n</p>\r\n<p>\r\nWant to enlist yourself on this dashboard?? Register for the certification exam <a href=\"https://www.codechef.com/certification/data-structures-and-algorithms/registration\">here</a>.\r\n</p>","userId":{"$oid":"5b5d752b37392f89933e7513"},"createdAt":{"$date":"2019-01-09T15:19:21.626Z"},"updatedAt":{"$date":"2019-10-07T12:24:26.396Z"},"__v":0},{"_id":{"$oid":"5c3788d2f647780022d5689d"},"tags":["SRM06"," #BlackMirror"],"title":"Single Round Match #06","content":"Greetings to everyone and welcome to the sixth single round match. I, Aditya Parthasarathy, am the problem setter for the same.\r\n\r\nThe contest will start on 13th January 2019 (Sunday), at 7 PM IST, and will last for 3 hours (will end at 10 PM IST). The theme of this contest will be #BlackMirror, an anthology series that revolves around a group of people's personal lives and how technology manipulates their behaviour. The problem statements are roughly based on the episodes of show (don't worry, there aren't any spoilers).\r\n\r\nThere will be 3 problems of varying difficulty of 100-200-250 points respectively. The penalty due to WA/CE/RTE/TLE solutions for problem will be applicable only after getting an AC solution. Scoreboard is updated with ICPC style of rankings where users solving more problems and earliest will be at the top. Time penalty of 20 minutes for each unsuccessful attempt will be the difference factor.\r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and solutions will be uploaded after the contest has ended.\r\n\r\nSpecial thanks to Omkar Prabhu and Rahul Sawantdesai for giving me the opportunity to set the problems and helping me testing the same.\r\n\r\nFeel free to contact me or anyone in the CodeChef Campus Chapter team if any there's any kind of discrepancy found in the problem statements.\r\n\r\nGodspeed programmers!","userId":{"$oid":"5b6c6860746b5e0020a32aa7"},"createdAt":{"$date":"2019-01-10T18:02:58.199Z"},"updatedAt":{"$date":"2019-10-07T12:24:34.002Z"},"__v":0},{"_id":{"$oid":"5c3b6d37b4920600229da70c"},"tags":["SRM06"," BlackMirror"],"title":"Single Round Match #06 -- Report","content":"Congratulations participants! Thank you for participating in SRM06.\r\n\r\nThe top 5 coders of #SRM06 are:\r\n<ol>\r\n  <li>Mithil Kiran Poojary</li>\r\n  <li>Barath Suresh Nadar</li>\r\n  <li>Gokul P Gopinath</li>\r\n  <li>Vignesh Moorthy</li>\r\n  <li>Ashok Choudhary</li>\r\n</ol>\r\n\r\nEditorial: <a href = \"https://drive.google.com/open?id=1ta4fFLwjxzcf-uQ1CQAVeZKSsTN3QoEY\"> Click Me! </a> ","userId":{"$oid":"5b6c6860746b5e0020a32aa7"},"createdAt":{"$date":"2019-01-13T16:54:15.609Z"},"updatedAt":{"$date":"2019-10-07T12:24:30.681Z"},"__v":0},{"_id":{"$oid":"5c49b44244ea9e0022aad642"},"tags":["Playlists"," FE"," introduction"],"title":"FEs! Introducing Playlists!","content":"<b>Hey fellow coders!</b>    \r\n\r\n If you aren't familiar with competitive programming, no problem! I was introduced to it by my seniors, and am very glad it happened!  \r\n\r\nAnd as of this writing, I am not great at it, but constantly learning, it has a different fun part associated with it 😋 . Basically competitive programming is the act of using the power of computers to our advantage, to solve problems, puzzles!    \r\n\r\n<b>W</b>e are introducing <a href=\"http://arena.siesgst.ac.in/playlists\">playlists</a>!   👏🏼  👏🏼  👏🏼    \r\n\r\nThis is a section here in arena where you can access proper solutions to questions, which is exactly what you want! It is a series of steps that a competitive programmer would need to follow, eventually leading to success! Moreover, it is written by FEs, so we know exactly what you want, and yes we have got you covered! So go ahead and give it a try friends!\r\nHere, we go through the question right from reading and dissecting the question in English right up to converting all the junk to computer language 😆!    \r\n\r\n<b>But I have never learnt coding?</b>  \r\n\r\nOh, then this is the best opportunity to learn! I was a beginner and the rate at which I learnt programming was insane! All thanks to competitive programming. I don't know how much I can stress this point, but definitely competitive programming is the best way to start your journey in the ocean of computer programming.  \r\n\r\n<b>I had tried once earlier, but I failed...</b>  \r\n  \r\nThat is totally cool guys, we all have been through this 😆 ! Give playlists a go, I am sure you will get better. I wished the playlist existed earlier when I had just begun!  \r\nI would like to say, as a FE student, it is easy guys... The result is great 🤩 , and the path is just awesome! Learning competitive programming has unlocked so many opportunities for me! \r\nWish you all the very best for your journey to becoming a coding ninja! 👍","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-01-24T12:49:06.882Z"},"updatedAt":{"$date":"2019-01-27T11:11:35.024Z"},"__v":0},{"_id":{"$oid":"5c4ad08391b74800225c106c"},"tags":["Hackathon","ByteCamp'19"],"title":"ByteCamp'19","content":"Bytecamp'19 , SIES GST's very own hackathon is back for its 3rd iteration. This year's Hackathon revolves around the use of technology to provide solutions for the betterment of the society and exploring the avenue of use of Technology in different Social Sectors. ByteCamp'19 not only promises to be helpful for the betterment of society but also the conglomeration of intelligent systems.\r\n\r\nWhat's a hackathon?\r\n\r\nHackathon is a place where you try to develop prototypes for your ideas within limited period of time. It is where ideas emerge, developers evolve, nerds chill out and science accelerates further.\r\n\r\n\r\n\r\nLast day for registration and submission of ideas(abstracts) is  FEB 03 2019.\r\n\r\nByteCamp'19 is scheduled to be organized on FEB 23-24 2019.\r\n\r\nVisit https://bytecamp19.hackerearth.com to know more.\r\n\r\nHappy Hacking!","userId":{"$oid":"5b659a0c64290b0020a95960"},"createdAt":{"$date":"2019-01-25T09:01:55.98Z"},"updatedAt":{"$date":"2019-10-07T12:24:22.364Z"},"__v":0},{"_id":{"$oid":"5c4d412f4f66dc0022a58654"},"tags":["Hackathon"," ByteCamp'19"," GivingBack"],"title":"Single Round Match #07","content":"Greetings to everyone and welcome to the seventh Single Round Match. We, Venkhatesh and Sanoop, are the problem setter for the same.\r\n\r\nThe contest will start on 27th January 2019 (Sunday), at 7 PM IST, and will last for 3 hours (will end at 10 PM IST). The theme of this contest will be #ByteCamp'19,  SIES GST's very own hackathon which revolves around the use of technology to provide solutions for the betterment of the society and exploring the avenue of use of Technology in different Social Sectors. \r\n\r\nThere would be 3 problems of varying difficulty of 100-200-400 points respectively. The penalty due to WA/CE/RTE/TLE solutions for problem will be applicable only after getting an AC solution. Scoreboard is updated with ICPC style of rankings where users solving more problems and earliest will be at the top. Time penalty of 20 minutes for each unsuccessful attempt will be the difference factor.\r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and solutions will be uploaded after the contest has ended.\r\n\r\nThanks to our contest admin Ninad and problem tester Rahul.\r\n\r\nSpecial thanks to Omkar Prabhu for giving us the opportunity to set the problems.\r\n\r\nFeel free to contact us or anyone in the CodeChef Campus Chapter team if any there's any kind of discrepancy found in the problem statements.\r\n\r\nGodspeed programmers!","userId":{"$oid":"5b6541b064290b0020a9594a"},"createdAt":{"$date":"2019-01-27T05:27:11.792Z"},"updatedAt":{"$date":"2019-10-07T12:24:15.289Z"},"__v":0},{"_id":{"$oid":"5c4da63ec5908c002216d085"},"tags":["turingcup","tc2019","CodeLearnWin","SIESGSTarena"],"title":"Invitation to the Turing Cup 2019","content":"Hello Coders!\r\n\r\nI, on behalf of the Codechef Campus Chapter at SIES Graduate School of Technology invite you all to the 2nd iteration of the Turing Cup!\r\n\r\nThe Turing Cup is named in honour of Alan Turing - the father of the modern computer. It was started in February 2018 with the aim of creating awareness about Competitive Programming and its importance in our college. The rise of Competitive Programmers in our college due to such contests motivated us to bring the 2nd iteration of the Turing Cup.\r\n\r\n**Schedule :  \r\nQualifiers :**   \r\nStart time :- 16th February - 00:00 IST  \r\nEnd time :- 17th February - 23:59 IST  \r\nContest Platform: CodeChef  \r\n\r\n**Onsite Finals :**   \r\nMarch ( Date and Timing will be announced soon )  \r\nContest Platform: CodeChef  \r\nAddress: SIES Graduate School of Technology, Nerul, Navi Mumbai, 400 706  \r\n\r\n**NOTE : You need to register for this contest as it will be a closed contest**   \r\n\r\n**Registration :**   \r\nFee :- 50 Rs  \r\nPayment methods :-  \r\n\r\n - Cash (For SIES GST Students only)\r\n\r\n  \r\n\r\n - UPI (Details given in registration\r\n   form)\r\n\r\n  \r\nRegistration Link :-  \r\n [https://docs.google.com/forms/d/e/1FAIpQLSfXm6IeODdT3bVPoxf7rnVaulXZ0n_mktw2EfxtK0HyunAZZw/viewform][1]\r\n\r\n\r\n**Top 10 students from SIES GST and top 10 students outside SIES GST will participate in the finals.**\r\n\r\n**Prizes Worth Rs. 10,000 and more are to be won. Goodies and Certificates will be given to the Top 20 onsite finalists!**\r\n\r\n**Official Page :** [http://arena.siesgst.ac.in/turingcup][2]\r\n\r\nJoin Alan Turing to solve some fun and interesting problems! See you on the \r\nscoreboard!\r\n\r\nGodspeed!\r\n\r\n\r\n  [1]: https://docs.google.com/forms/d/e/1FAIpQLSfXm6IeODdT3bVPoxf7rnVaulXZ0n_mktw2EfxtK0HyunAZZw/viewform\r\n  [2]: http://arena.siesgst.ac.in/turingcup\r\n","userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2019-01-27T12:38:22.594Z"},"updatedAt":{"$date":"2019-10-07T12:26:57.27Z"},"__v":0},{"_id":{"$oid":"5c4ddfa54191fd0022a7e228"},"tags":["SRM07 "," ByteCamp'19 "," #GivingBack"],"title":"Single Round Match #07 -- Report\r\n","content":"Congratulations to all participants of SRM07. \r\n\r\nWe are happy to announce top coders of #SRM07 :\r\n1. Vipul Singh Raghuvanshi\r\n2. Mithil Kiran Poojary\r\n\r\neditorials: https://drive.google.com/open?id=1M21AqZikU5jyAA9Ib3VQUR9zfHdjAwKa\r\n\r\nDo let us know your thoughts about contest.\r\n\r\n\r\n","userId":{"$oid":"5b659a0c64290b0020a95960"},"createdAt":{"$date":"2019-01-27T16:43:17.956Z"},"updatedAt":{"$date":"2019-10-07T12:23:46.872Z"},"__v":0},{"_id":{"$oid":"5c4f44f9356145002207fbf9"},"tags":["Memory"," story"," developer"," programming"],"title":"So much to remember!","content":"I always wonder, how do these programmers and developers remember these cool magical statements which literally change the world, or at least get them an AC on a problem statement😆.  \r\nI just admire this skill to remember all sorts of algorithms, statements, functions, headers, tricks and shortcuts! How do they keep all this in mind, without letting any piece of the code escape, or avoiding irrelevant stuff at any time?  \r\nProgramming is endless, maybe flappy bird ends somewhere, but programming... NEVER! You can keep learning, working, learning and still never keep up with the technology advancements (which is what I like about the entire idea behind programming)! Keep digging and digging, there is no sea bed stopping your way! Only increasing complexity can stop you, that too if you let it do so!  \r\nWhen you begin, you are enjoying every tiny bit of code you write! You want to master the entirety of the language (or at least that's the case with me 😉 )! You start writing code on your PC and saving them locally. Or better you get a new notebook for writing the code! I have done this when I first time saw code! Naa not c++ or python, but HTML😝. I was so fascinated that I drew columns, enough to fit in a single character in each cell. I literally filled the entire notebook. Drawing those lines alone was a trip to the moon.  \r\nSoon, programming becomes overwhelming huge! And that's when I quit the notebook practice 😅.  \r\nIt is difficult to understand what is relevant and what is not. Now actually getting to the answer, how is it humanly possible to store all this logic into the brain? Let me share some ways I remember code... Or at least make some implementation which make the code easily accessible later.  \r\nI don't know something, or I don't understand how to do this...  \r\nLet's Google it then! But what to google? \"Code for binary search in c++\" OR \"How does binary search work?\". Well always take no shortcuts in this fun journey, move bit far, wander near the rivers, breathe the pleasant air, maybe get pricked with a cactus on the way  🤣 but, learn the wilderness of this jungle.  \r\nCopy pasting is good, saves time. But only once you have understood it, and if you have typed it sometime back at least once. I like to keep some tasty code, maybe on my github, or in form of text tutorials, or somewhere.  \r\nSome of my code, when I don't remember, is easily available to me all time. Maybe in form of some previous solution I uploaded. So, these were some ways I store code.... But Mithil, we were supposed to know how one remembers code right?  \r\nTo be honest, it is a question I will also like to know the answer of... Only time will tell me based on my experience. Glad you made it this far! Hopefully you liked it! Thanks for reading! Keep coding!\r\n ","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-01-28T18:07:53.54Z"},"updatedAt":{"$date":"2019-08-31T17:04:36.439Z"},"__v":0},{"_id":{"$oid":"5c4ff13e3027fa0022016618"},"tags":["google"," io"," io2019"," updates"],"title":"Google I/O 2019 Updates!","content":"<strike>I'll try to write this time about latest releases and announcements via [Google I/O 2019](https://events.google.com/io/)</strike> Read Below!\r\n\r\n[**> Take me to Google I/O 2019 All Videos Playlist <**](https://www.youtube.com/watch?v=BOHK_w09pVA&list=PLOU2XLYxmsILVTiOlMJdo7RQS55jYhsMi)\r\n\r\nAfter following Google I/O since last 6 years, I can say that Google has finally made the production use of ML Research the best. And yeah, with Jeff Dean closing it, we cannot ask for more. It is always essential to introduce new technology and products at I/O and see people going nuts over it but this year with the ending of Official Keynote, Google assured that it is trying to solve fundamental problems in Healthcare with their latest technology as well.\r\n\r\n1. **Inspiring Talks**:  \r\n - [Fireside Chat with Geoffrey Hinton](https://www.youtube.com/watch?v=UTfQwTuri8Y&list=PLOU2XLYxmsIJ5Bl3HmuxKY5WE555cu9Uc&index=11) - Pioneer of Deep Learning, talking about his research work and the history. (you should know why he gave his interview standing :P)\r\n - [Deep Learning to Solve Challenging Problems](https://www.youtube.com/watch?v=rP8CGyDbxBY&list=PLOU2XLYxmsIJ5Bl3HmuxKY5WE555cu9Uc&index=5) - Promising work, very inspiring as always. To know more about Jeff, [read here](https://www.newyorker.com/magazine/2018/12/10/the-friendship-that-made-google-huge).     \r\n   \r\n2. **Machine Learning**:  \r\n - [Tensorflow 2.0 is here!!!!!](https://www.youtube.com/watch?v=lEljKc9ZtU8) - ow can we miss that? A very cool set of changes in API which are at alpha for now. People from PyTorch are gonna love it with the latest set of TF APIs and with the Keras Backend, it is mind blowing!\r\n - [Better ML on Device](https://www.youtube.com/watch?v=yQuUDX6r2Ic&list=PLOU2XLYxmsIKW-llcbcFdpR9RjCfYHZaV&index=4) - Easy to use guides for ML on Android Phones.\r\n - [Federated Learning](https://www.youtube.com/watch?v=89BGjQYA0uE&list=PLOU2XLYxmsIKW-llcbcFdpR9RjCfYHZaV&index=6) - Something disruptive for Tensorflow, quite good improvement since last 1 year.\r\n  \r\n3. **Android**:  \r\n - [Build a Modular Android App Architecture](https://www.youtube.com/watch?v=PZBg5DIzNww) - Very good way to architect modular applications.\r\n[Plaid](https://github.com/android/plaid) is the best app to see how its done.  \r\n - [Architecture Components](https://www.youtube.com/watch?v=Qxj2eBmXLHg&list=PLOU2XLYxmsILVTiOlMJdo7RQS55jYhsMi&index=44) - Latest changes and support for new libraries like WorkManager. Minor changes for Room and older libraries. Good to go through it.  \r\n    \r\n4. **Web**:  \r\n - [Build Material Theme](https://www.youtube.com/watch?v=IaT4wdWTwuo) - Test it in action for Web [here](https://material-theme-builder.glitch.me/#). Amazing set of tools for Material Components.\r\n - [New with Chrome and Web](https://www.youtube.com/watch?v=rUUazNIZW7I) - Making the Web Dev powerful and better with new set of amazing tools. We can say that websites are becoming more like apps every day having a potential to do multiple things.  \r\n\r\nThis is my must watch playlist of Google I/O 2019. (Please bare with me, this will be updated again in few days)\r\n\r\n- May 7, 8, 9 and I/O is here with list of codelabs and event calendar. [Schedule](https://events.google.com/io/schedule/events/)\r\n\r\n- The site is live and is showing a cryptic video. [Can you discover the I/O transmission?](https://events.google.com/io2018/transmission/)","userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2019-01-29T06:22:54.253Z"},"updatedAt":{"$date":"2019-05-11T12:26:10.813Z"},"__v":0},{"_id":{"$oid":"5c55b491cd61f40022177445"},"tags":["SRM"," FE"," college"],"title":"Single Round Match #08","content":"Thank you for being here! I am very excited to announce that SRM 08 will be live on Sunday, February 3rd 2019 at 7 p.m.  IST.  The problem setters are me and Barath. The theme is based on something around which our life currently revolves all day! That is 'college'!  \r\n  \r\nThis contest is particularly for all my FE friends, to get them started in the beautiful journey in competitive programming. And best part is, it is set by FEs too! So we know exactly what you want to get the boost!  \r\n  \r\nI highly encourage everyone to participate! Well here is some details about the contest. There will be 3 problems with 100, 200 and 250 awarded for an accepted solution. There is a time penalty of 20 minutes for every unaccepted solution. But the time penalty is only applied once the solution becomes accepted.  \r\n  \r\nYou can refer internet, and we highly encourage you to do so.  \r\nSpecial thanks to Omkar Prabhu, Rahul Sawantdesai, Swapnil Shinde, Ninad Chavan , Shambhavi Sudarsan, Harsh Agrawal  and the entire arena team for giving us the opportunity to set the problems, and for everything they have done for us!  \r\n  \r\nFeel free to contact us or anyone in the CodeChef Campus Chapter team if any there's any kind of discrepancy found in the problem statements.","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-02-02T15:17:37.744Z"},"updatedAt":{"$date":"2019-10-07T12:23:41.963Z"},"__v":0},{"_id":{"$oid":"5c5717d087ce5400224dc1ae"},"tags":["SRM08"," FE"," Report"," Editorial "],"title":"SRM08 -Report","content":"Now we are concluding  SRM08 congratulations to everyone who tried .To all the FE who tried this contest if you were not able to solve the problem its okay even when i tried my first SRM i had a score of -40 so keep trying All  the best.Looking forward to seeing you all in Turing Cup until then bye and have a nice day.\r\n\r\nThe top 5 coders of SRM08:\r\n\r\n1)Vipul Singh Raghuvanshi\r\n\r\n2)sanoop menon\r\n\r\n3)Gokul P Gopinath\r\n\r\n4)Pritam Negi\r\n\r\n5)Aditya Parthasarathy \r\n\r\neditorials:\r\nhttps://drive.google.com/drive/u/2/folders/1rosp9JwpJlPKPPclahd-7jKt971jJ8Xo\r\n\r\n","userId":{"$oid":"5b6d84eb2e9049002068df33"},"createdAt":{"$date":"2019-02-03T16:33:20.244Z"},"updatedAt":{"$date":"2019-10-07T12:23:29.069Z"},"__v":0},{"_id":{"$oid":"5c7bcaf95dfcc900221e1147"},"tags":["SRM","PUBG"],"title":"Single Round Match #09","content":"<p>Warm greetings to all the coders out there!</p>\r\n<p>Welcome to the <b>Codechef Campus Chapter </b>.</p>\r\n Me ,<a href =\"http://arena.siesgst.ac.in/profile/5b67014c91c77d0020b63d25\"> Ninad Chavan</a> and <a href=\"http://arena.siesgst.ac.in/profile/5b606d47e228ec0020a1fcf1\">Harsh Sanjay Agrawal</a> will be the problem setters for Single Round Match #09.<br>\r\n\r\n<p>The contest will commence on 3rd March (Sunday) for 3 hours from <b>7:00 PM to 10:00 PM</b>. Theme for this contest is <b>PUBG</b>. I hope the theme itself is more than enough to excite you for a \"CHICKEN DINNER\".  </p>\r\n\r\n<p>There will be 3 problems of varying difficulty of <b>100-200-300</b> points respectively. The penalty due to WA/CE/RTE/TLE solutions for problem will be applicable only after getting an AC solution. Scoreboard is updated with ICPC style of rankings where users solving more problems and earliest will be at the top. Time penalty of 20 minutes for each unsuccessful attempt will be the difference factor.</p>\r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action.<br>\r\n<p>Feel free to contact us or anyone in the <b>CodeChef Campus Chapter</b> team if any there's any kind of discrepancy found in the problem statements</p>\r\n\r\nSpecial thanks to Ninad Chavan for helping in testing the problems.<br>\r\n\r\nSee you at the arena at 7:00.<br>\r\n\r\nGoodluck and godspeed programmers!\r\n\r\n","userId":{"$oid":"5b607d4fe228ec0020a1fcf2"},"createdAt":{"$date":"2019-03-03T12:39:21.764Z"},"updatedAt":{"$date":"2019-10-07T12:23:37.575Z"},"__v":0},{"_id":{"$oid":"5c7c031b3d26a70022f23062"},"tags":["SRM","PUBG"],"title":"SRM09 - Report","content":"Congratulations to all the participants. Thank you for taking part in SRM09.\r\n\r\nThe top coders of #SRM09 are:\r\n\r\n\t1. Mithil Kiran Poojary\r\n\t2. Aakash Chavan\r\n\t3. Vipul Singh Raghuvanshi\r\n\t4. Aditya Parthasarathy\r\n\r\nEditorials: https://drive.google.com/open?id=19K8clHsco3PAzMCEK9MKMQC83WDkOxW0\r\n\r\nI hope you all enjoyed the Chicken Dinner! Stay tuned for more contests!\r\n","userId":{"$oid":"5b67014c91c77d0020b63d25"},"createdAt":{"$date":"2019-03-03T16:38:51.55Z"},"updatedAt":{"$date":"2019-10-07T12:23:19.406Z"},"__v":0},{"_id":{"$oid":"5c92a17561abb900226a47e4"},"tags":["Maximum sum sub-array problem"," divide and conquer"],"title":"Maximum sum sub-array problem","content":"The problem goes as :\r\nYou're a programmer. You get placement in Mahindra. But you were dreaming of Google. Now all you can do is buy shares from Google. You have future predictions for the next 17 days as follows:\r\n<table style=\"width: 516px;\">\r\n<tbody>\r\n<tr>\r\n<td style=\"width: 39px;\">\r\n<p>Day</p>\r\n</td>\r\n<td style=\"width: 31px;\">0</td>\r\n<td style=\"width: 30px;\">1</td>\r\n<td style=\"width: 30px;\">2</td>\r\n<td style=\"width: 23px;\">3</td>\r\n<td style=\"width: 31px;\">4</td>\r\n<td style=\"width: 31px;\">5</td>\r\n<td style=\"width: 23px;\">6</td>\r\n<td style=\"width: 23px;\">7</td>\r\n<td style=\"width: 23px;\">8</td>\r\n<td style=\"width: 31px;\">9</td>\r\n<td style=\"width: 23px;\">10</td>\r\n<td style=\"width: 31px;\">11</td>\r\n<td style=\"width: 31px;\">12</td>\r\n<td style=\"width: 23px;\">13</td>\r\n<td style=\"width: 23px;\">14</td>\r\n<td style=\"width: 23px;\">15</td>\r\n<td style=\"width: 22px;\">16</td>\r\n</tr>\r\n<tr>\r\n<td style=\"width: 39px;\">Price</td>\r\n<td style=\"width: 31px;\">100</td>\r\n<td style=\"width: 30px;\">113</td>\r\n<td style=\"width: 30px;\">110</td>\r\n<td style=\"width: 23px;\">85</td>\r\n<td style=\"width: 31px;\">105</td>\r\n<td style=\"width: 31px;\">102</td>\r\n<td style=\"width: 23px;\">86</td>\r\n<td style=\"width: 23px;\">63</td>\r\n<td style=\"width: 23px;\">81</td>\r\n<td style=\"width: 31px;\">101</td>\r\n<td style=\"width: 23px;\">94</td>\r\n<td style=\"width: 31px;\">106</td>\r\n<td style=\"width: 31px;\">101</td>\r\n<td style=\"width: 23px;\">79</td>\r\n<td style=\"width: 23px;\">94</td>\r\n<td style=\"width: 23px;\">90</td>\r\n<td style=\"width: 22px;\">97</td>\r\n</tr>\r\n</tbody>\r\n</table>\r\n<p> </p>\r\nYou decide when you buy, when you sell. Maximize the profit! Since you are a programmer, this isn't a big task for you right? So I wrote this brute-force code:\r\n<script src=\"https://ideone.com/e.js/Z6tgq5\" type=\"text/javascript\" ></script>\r\nMax profit of 43 when you buy on 7 day and sell on 11 day.\r\n\r\nThis works (and am proud of it!) but this is the reason why you didn't land a job at Google. Your code is slow!\r\nHere is a better approach:  \r\n\r\n<script src=\"https://ideone.com/e.js/DQ3qFH\" type=\"text/javascript\" ></script>\r\nThis is divide and conquer, something that I've learnt very newly. It is fast, and works very well. But I don't understand why I am not getting the lower-limit and upper-limit (which was actually the goal) for the array  😥. Sorry about that 😣 \r\nOtherwise, this approach gives the correct sum value. There are more as such, like Kadane's algorithm, DP based algos, etc. This was just for an introduction to divide and conquer!  \r\nSo, keeping it very brief, I move on next to <Editing later>","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-03-20T20:24:21.675Z"},"updatedAt":{"$date":"2019-03-31T16:00:07.764Z"},"__v":0},{"_id":{"$oid":"5d0509a465457b00228d9a19"},"tags":["github"," coding"],"title":"Has anyone used \"Jump to Definition\" on GitHub?","content":"Its fucking amazing!   \r\n<center>\r\n<img src=\"https://i.imgur.com/1fCw1NM.png\" width=\"75%\">\r\n</center>\r\n<br>  \r\n\r\nAs it says _''For a subset of public repositories, you can jump to a function or method's definition within the same repository by clicking the function or method call in a file.''_  \r\nCheck out more about it [here](https://help.github.com/en/articles/navigating-code-on-github).\r\n\r\nHow about SIESGSTarena's code viewer also links a code's standard functions like this with their official language API and its documentation?","userId":{"$oid":"5b5c89298114180020d4bcb0"},"createdAt":{"$date":"2019-06-15T15:07:16.241Z"},"updatedAt":{"$date":"2019-07-07T15:22:36.95Z"},"__v":0},{"_id":{"$oid":"5d2224c5a819760022ecaf04"},"tags":["GBYE19"," Swedish House Mafia"," Editorial"," C++"," Python"," Java"],"title":"Swedish House Mafia Editorial","content":"<a href=\"http://arena.siesgst.ac.in/contest/GBYE19/problem/GBYE19A\">Link to question</a>  \r\nThe question itself is pretty easy. All you gotta do is find if given integer is divisible by 3 or not. Now the inbuilt function, the remainder function, a%b, works well. But not if you couldn't even store a number as large as 1e100.  \r\nBut we could add digits and find if it is divisible by 3. This sum won't exceed 900. The implementation of the code in c++ :  \r\n<script src=\"https://gist.github.com/Mithil467/4161da909b98f7d96f80dff08ef592b6.js\"></script>  \r\nIf you use python, don't worry about the constraints lol as python has in-built support for large numbers.","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-07-07T16:58:45.187Z"},"updatedAt":{"$date":"2019-07-08T05:17:56.413Z"},"__v":0},{"_id":{"$oid":"5d247dd4a6252b0022a84a45"},"tags":["GBYE19"," editorial"," c++"],"title":" The Chat Pattern Editorial","content":"<a href=\"http://arena.siesgst.ac.in/contest/GBYE19/problem/GBYE19G\">Link to problem</a>  \r\nThis problem is very simple, while the implementation is long as there is some code that is required, but logically thinking, there is nothing much to think about this problem.  \r\nThe first problem arises with separating the input string with spaces. You could do something like taking input of a word, process it and output the formatted word with a space ahead and continue till you hit newline. I would prefer taking the whole line as input and then later separating into words.  \r\nIn order to do that, we would create a empty string and traverse over the input string (which now is the entire line and not single words) and copy every single word into the empty string till you hit a space. This would you give the first word. Now pass this word as input to some other function that does the formatting and proceed to the next word by emptying the string and continuing your string iteration till you hit the next space or possibly end of the string. This is all about separating words.  \r\nNow let's actually go over the formatting method. The best case to consider is \"Hard Harder Hardest\". It has all the possible outputs, here in which case it is \"HarD HaRDeR HaRdEsT\". Now you notice here, when the length of word is odd, you don't have to worry about any middle character formatting as such. So that is simple to implement. I did so by iterating over the string and if i (index) is even just capitalize it else lowercase it.  \r\nSimple enough. Now comes the Hard part. I mean the word \"Hard\". Things to note, length of word is even. So simple thought, if word is even then make the middle characters (mid/2 and mid/2+1 indexed characters) lowercase! But wait isn't \"harder\" even too? Then why is it so that the middle characters are uppercase instead?  \r\nThe logic here again is if the length is even, and half-of-length is also even then middle characters will be lowercase, else uppercase.  \r\nNow we just need to implement it in the code!  \r\nCheck out the complete implementation below :  \r\n<script src=\"https://gist.github.com/Mithil467/b12a5069777e4112b480d4c1b527b395.js\"></script>  \r\nI used toupper and tolower functions here. But during the contest the solution I wrote was a mess XD. Also remember, these functions return a integer and not a character. Hence using putchar is mandatory or else use type casting.","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-07-09T11:43:16.562Z"},"updatedAt":{"$date":"2019-07-31T18:23:08.539Z"},"__v":0},{"_id":{"$oid":"5d24ed106d01680022387e88"},"tags":["team","interview","SIESGSTarena"],"title":"Team SIESGSTarena 2019-20","content":"Competition for talent hasn’t ever been this fierce before. Getting just a nominal degree is no longer enough. You need to go that extra mile to ensure your talent is noticed. We here at SIESGSTarena invite you, and hence provide you with this excellent opportunity to join us in competitive programming and development of open source projects. Practising technology is hard, but it’s definitely not rocket science and with some extent of practice, you’ll get closer to covering this “extra mile”, if not ahead. But at SIESGSTarena, we provide you with the excellent opportunity to get all the real life practice needed by building projects, working in teams just like industries do. But you know what makes all the hard work worth the efforts? The satisfaction of working with a great team, that you would never forget.","userId":{"$oid":"5b606d47e228ec0020a1fcf1"},"createdAt":{"$date":"2019-07-09T19:37:52.939Z"},"updatedAt":{"$date":"2019-10-07T12:26:47.397Z"},"__v":0},{"_id":{"$oid":"5d26398f8428300022a422e3"},"tags":["Editorial"," C++"," GBYE19"],"title":"Don't You Worry Child Editorial","content":"<a href=\"http://arena.siesgst.ac.in/contest/GBYE19/problem/GBYE19C\">Link to the problem.</a>  \r\nThis problem is known as maximum sum subarray problem. I already have a blog on it here on arena! Check out the divide and conquer solution <a href=\"http://arena.siesgst.ac.in/blog/5c92a17561abb900226a47e4\">here</a>. Anyways, here we will be using another algorithm which is easier to understand. The Kandane's algorithm. First of all, we have to input 'n' numbers and then make a 'n*m' size array with repeated copies of these 'n' numbers. There are many ways to achieve this.  \r\nWe simply do this here  \r\na[i] = a[n-i] // where i is from n to n*m-1  \r\nNow we just have to find the maximum sum. Let me explain the Kandane's algorithm to you.  \r\nWe keep adding the elements till we encounter a net negative sum in which we restart the process. Then we just need to find the maximum element ! Easy stuff!  \r\n<script src=\"https://gist.github.com/Mithil467/302f8aee96b6518ebd2dfe395152b388.js\"></script>  \r\nBut wait! There is a catch! kandane's algorithm requires at least one element to be non-negative! What now? Well, then all you need to do is have a check on the input 'n' numbers itself and if all are negative just output the minimum of all these n numbers and output that!","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-07-10T19:16:31.563Z"},"updatedAt":{"$date":"2019-07-10T20:08:23.543Z"},"__v":0},{"_id":{"$oid":"5d3b27b3a5c0bb0022255d56"},"tags":["Coffee"," world"," competitive programming"," CP"],"title":"Learn to code, drink coffee, change the world","content":"Competitive programming is a very unique resource that I would recommend  to any student (or hobbyist) interested in raising their algorithmic programming skills to the next level. This Colosseum has many wise tips, that are hard to find anywhere else and here at SIESGSTarena, we believe in making it happen.  A step which I know if taken will fetch me knowledge and will help me improve. It's showing me results, and I want to share it with you.  \r\n\r\nI am a student, but a programmer as more of a hobbyist, which in turn has affected me positively in my engineering studies as well, which is quite natural. We future engineers will be building world changing tech. You must stand out in this competitive crowd to even stand a chance to receive a opportunity to prove yourself. Not starting, or being too late, is the most common reason of guilt I have seen in seniors pursuing programming jobs. Programming even if not required (in any rare case) in any particular tech, will greatly help you to build firmer understanding in tech literacy. Overall programming is very important and I believe it makes you intelligent and thoughtful.    \r\n\r\nHere we present you with multiple such opportunities in terms of competitive programming contests where you can have a perfect start to this journey from hello world to being the reason of your own success.  Program yourself to succeed. All the best!","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-07-26T16:17:55.842Z"},"updatedAt":{"$date":"2019-07-31T15:58:04.178Z"},"__v":0},{"_id":{"$oid":"5d3d6f864f4af90022b364cf"},"tags":["Beta Round"," Beginners"],"title":"BETA Round #01","content":"Warm greetings to all the coders!\r\n\r\nWelcome to the <b>CodeChef Campus Chapter</b>.\r\n\r\nWe are very excited to announce that we will be hosting <b>BETA Round 01</b> which will be held <b>online</b> on <b>Sunday, July 28th 2019</b> from <b>7:30 PM IST</b>. This contest is <b>'Super Beginner Friendly'</b> and the perfect way to start your programming journey and to raise your coding skills. \r\n\r\nMe and Rahul Sawantdesai will be the problem setters and testers for this contest. \r\nThere will be 5 problems with varying difficulty of <b>100-100-100-200-300</b> points respectively. There is a time penalty of 20 minutes for every unaccepted solution. But the time penalty is only applied once the solution becomes accepted.\r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action.\r\n\r\nFeel free to contact us or anyone in the <b>CodeChef Campus Chapter</b> team if there's any kind of discrepancy found in the problem statements.\r\n\r\nSee you at the arena at 7:30 PM.\r\n\r\nGoodluck and godspeed programmers!\r\n","userId":{"$oid":"5b67014c91c77d0020b63d25"},"createdAt":{"$date":"2019-07-28T09:48:54.798Z"},"updatedAt":{"$date":"2019-10-07T12:23:08.895Z"},"__v":0},{"_id":{"$oid":"5d3dd5b91132780022915e5f"},"tags":["Beta Round","Report","Beginners"],"title":"Beta Round #01 - Report","content":"Congratulations and a lot of thanks to all the participants!\r\n\r\nHere are the top performers of the round:\r\n\r\n1) Mithil Kiran Poojary <br>\r\n2) Vipul Singh Raghuvanshi  <br>\r\n3) Atharva <br>\r\n4) Shubham Kokane <br>\r\n5) Barath Suresh Nadar <br>\r\n\r\n\r\n<b>Editorials:</b>\r\n<a href=\"https://drive.google.com/drive/folders/1Gyr9kO_qc29oivgwS9_5To7nI5dpeceL?usp=sharing\">Click Here</a>\r\n\r\n<b>Codes:</b>\r\n<a href=\"https://drive.google.com/drive/folders/12fJWjQRTqLiSxrS9vROQa0YJdyd2KWzK?usp=sharing\">Click Here</a>\r\n\r\n<b>Please help us by filling the feedback form :-</b> <br>https://forms.gle/2QM8uxZMZvc56h6k6\r\n\r\nFeel free to reach us in case of any doubts :)\r\n\r\nI hope you all enjoyed the round, stay tuned for more!\r\nGodspeed!\r\n","userId":{"$oid":"5b5ca6857cf0b100209fe499"},"createdAt":{"$date":"2019-07-28T17:04:57.02Z"},"updatedAt":{"$date":"2019-10-07T12:22:59.625Z"},"__v":0},{"_id":{"$oid":"5d4d83d607b7510022141b35"},"tags":["SRMX","pokemon "],"title":"SRM #X","content":"Warm greetings to all the coders!\r\n\r\nWelcome to the <b>CodeChef Campus Chapter</b>.\r\n\r\nWe are very excited to announce that we will be hosting <b>SRM X</b> which will be held online on <b>Saturday, August 10 2019</b> from <b>7:30 PM IST</b>. Welcome to the <b>first rated contest</b> of this semester.\r\n\r\nI  will be the problem setter and Ninad and Rahul will be the testers for this contest. There will be 3 problems with varying difficulty of <b>100-200-300</b> points respectively. There is a time penalty of 20 minutes for every unaccepted solution. But the time penalty is only applied once the solution becomes accepted.\r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action.\r\n\r\nFeel free to contact us or anyone in the CodeChef Campus Chapter team if there's any kind of discrepancy found in the problem statements.\r\n\r\nSee you at the arena at 7:30 PM.\r\n\r\nGoodluck and godspeed programmers!","userId":{"$oid":"5b6d84eb2e9049002068df33"},"createdAt":{"$date":"2019-08-09T14:31:50.143Z"},"updatedAt":{"$date":"2019-10-07T12:22:10.827Z"},"__v":0},{"_id":{"$oid":"5d4e7b399fde1500223f181c"},"tags":["Competitive Programming"," Mistakes"," Common Mistakes"," Beginner"," Amateur\r\n\r\n"],"title":"Here's What No One Tells You About Competitive Programming.","content":"Hello everyone, It's Surya here. This week we will talk about, some of the <b>most common mistakes in Contests by first-time programmers</b>. I have appeared in the Beta Contest for the first time, and the points discussed here will enhance your performance in the future contests, most importantly, the <b>SRM X</b> tonight!\r\n\r\n<b>Tip #1: Understand the Problem and its Output Case and write code without unwanted statements.</b> \r\nFor e.g, If the output(expected) is \"1 2 3 4 5 6 7 8\" and output of your program is \"Answer is 1 2 3 4 5 6 7 8\", the compiler will pose \"Wrong Answer\". \r\nA most common one is, printing \"Enter your input:\"/\"Enter your string:\" and printing unwanted statements like \"Processing....\"/\"The string is not a palindrome\", etc.\r\nThe Approach behind Competitive Programming is to get the output in the minimum time taken, and beginners must follow the spacing and indentation and output example properly. \r\nAlso, keep this in your bookmarks:  Writing programs in C/C++/Java has some prerequisites for getting right in our Compiler. <b>C/C++</b> requires the function return type to be <b>int with return 0</b> and <b>Java</b> needs the <b>class to be named as main and use JDK 8 as compiler.</b>\r\n \r\n\r\n<b>Tip #2: Getting the Variables declaration right!</b>\r\nThe second one is getting the output wrong because of not using 1LL/1ll when needed, <b>1LL/1ll</b> is used when operations involve getting a larger answer than an int variable could hold, we can use the <i>long long</i> in the variable declarations, in order to get the correct output.\r\n\r\n<b>Tip #3: Keep the variable sizes optimum and write code, considering the constraints. </b>\r\nI experienced this issue like any new one out in contests, it's getting \"Wrong Answer/Runtime Error\" even when your program satisfies the example case perfectly. This happens usually and reason behind is setting the size of elements very less such that larger test cases don't satisfy, to explain it better: char str[20] can store 19 lettered string, enough for small test cases, but for strings like \"Wolfe­schlegel­stein­hausen­berger­dorff­welche­vor­altern­waren­gewissen­haft­schafers­wessen­schafe­waren­wohl­gepflege­und­sorg­faltig­keit­be­schutzen­vor­\" won't be stored in the given str[20]. \r\n\r\n<b>Tip #4: Start knowing the Standard Library Functions of the programming language you pursue.</b> For e.g., in C++ we have vectors,maps,etc. where we can solve problems with lesser lines of code, we have many inbuilt functions like sort() and more. \r\n\r\n<b>Tip # 5: Practice writing Efficient Code.</b>\r\n Problem-solving is an art and solving those in a simplest and efficient manner is like the Picasso of this art. Beginners must understand the problem well and its <b>exception case/ running issues</b> so that they write code to solve them well. \r\n\r\nTry knowing about <a href=\"https://www.topcoder.com/blog/learning-understanding-big-o-notation/\">Big O Notation and Asymptotic Notations</a> which help in knowing the <b>efficiency of coding methods and algorithms</b>. \r\nWriting a few lines of <b>meaningful, efficient code</b> is more important than writing 1000 lines of code just to get <b>factorial of a number</b>!\r\n\r\nI hope the above-listed tips will help you improve your code and coding methods, and help you succeed in Competitive Programming!\r\n\r\n<b>Recommended  Sources:</b>\r\n\r\n<a href=\"https://www.geeksforgeeks.org/\">Geeks4Geeks</a>\r\n\r\n<a href=\"https://www.w3schools.com/\">W3Schools</a>\r\n\r\n<a href=\"http://arena.siesgst.ac.in/playlists\">Playlists to get started</a>\r\n\r\n<i>Thank you and All the best!</i>\r\n\r\n\r\n\r\n\r\n\r\n","userId":{"$oid":"5b6e6f112e29b100208b2e14"},"createdAt":{"$date":"2019-08-10T08:07:21.32Z"},"updatedAt":{"$date":"2019-08-11T04:59:42.968Z"},"__v":0},{"_id":{"$oid":"5d4efc4e5a6f360022db2221"},"tags":["Report","SRM"],"title":"SRM #X - Report","content":"Congratulations to everyone and Vipul Singh Raghuvanshi proved he is the very best by solving all the questions and being first on the scoreboard.\r\n\r\n**Here are the top performers of the round:**<br>\r\n1)Vipul Singh Raghuvanshi<br>\r\n2)Aditya Parthasarathy<br>\r\n3)Krithik Suvarna<br>\r\n4)Ashish Kedarisetti<br>\r\n5)Aditya<br>\r\n\r\n\r\n**Codes:** [Click here](https://drive.google.com/drive/folders/1w6rcvNNunTKBFHAqZW9eMLbaqlUrdctd?usp=sharing)\r\n\r\n**Editorials:** [Click here](https://drive.google.com/drive/u/3/folders/1CpAlGJ_SPTwPYCJLula6RbU6MdK4YMAN)\r\n\r\nFeel free to reach us in case of any doubts :)<br><br>\r\nI hope you all enjoyed the round, stay tuned for more! Godspeed!","userId":{"$oid":"5b6490e95969e7002076f330"},"createdAt":{"$date":"2019-08-10T17:18:06.841Z"},"updatedAt":{"$date":"2019-10-07T12:22:05.93Z"},"__v":0},{"_id":{"$oid":"5d600383ea727e0022282644"},"tags":["math","srm11"," srm"," cp"],"title":"SRM #XI","content":"<i>\"Math is tough\"\r\n\r\n\"Math is complicated\"</i>\r\n\r\nGreetings to all coders of SIESGST family!\r\n\r\n<b>Not this time, though!</b>\r\n\r\nWe would like to welcome you all to the <b>SRM 11</b>  , second rated contest of this semester hosted by our Campus Chapter . <b>SRM 11</b> has problems set by <b>Mithil and myself</b>, Testers of this Contest are <b>Rahul and Ninad</b>. \r\n\r\nSRM 11 is being held <b>online</b> on <b>Sunday , 25th August 2019 from 7.30pm to 10.30pm IST</b>. The theme for SRM 11 is <b>MATH</b>, that one thing we all feared to face. There will be 4 questions, of score <b>100-100-150-200</b> points, having difficulty levels ranging from <b>very easy to medium</b> ones. \r\n\r\nThere is a time penalty of 20 minutes for every unaccepted solution. But the time penalty is only applied once the solution becomes accepted.\r\n\r\nWe encourage to refer online resources in case of any difficulty, but plagiarism will be met with strict action from the Codechef Campus Chapter Team.\r\n\r\nIn case of any inconvenience, do reach out to the Codechef Campus Chapter or message us through mail/given contact details from the website below.\r\n\r\nSee you all at 7.30pm.\r\n\r\nGood luck and godspeed programmers!","userId":{"$oid":"5b6e6f112e29b100208b2e14"},"createdAt":{"$date":"2019-08-23T15:17:23.818Z"},"updatedAt":{"$date":"2019-10-07T12:21:45.558Z"},"__v":0},{"_id":{"$oid":"5d62c415e007440022d89e64"},"tags":["Report"],"title":"SRM #11 - Report","content":"Hearty Congratulations to our participants!  \r\nA total of 8 participants managed to score a perfect 550.  \r\n<b>Arvindraj Thangaraj</b>, with <b>Rank 1</b>, led the charge, securing the <b>first</b> position in this contest! <b>Aditya</b> has achieved a new feat of <b>Fastest AC</b> in under <b>02:40</b> surpassing the previous holder <b>(Me)</b> by a phenomenal <b>48</b> seconds!  \r\n  \r\n<b>Here are the top performers of the round:</b>  \r\n1) Arvindraj Thangaraj  \r\n2) Vipul Singh Raghuvanshi  \r\n3) Krithik Suvarna  \r\n4) srikrishna veturi  \r\n5) Ashish Kedarisetti  \r\n6) chetan ade  \r\n7) Anand Ramesh  \r\n8) Aditya  \r\n\r\nHere are the solutions:  \r\n<a href=\"https://drive.google.com/drive/u/0/folders/19K7VlktzwtUxs9verCGEv6dPTjfTLIaD\"><b>Codes</b></a>\r\n<a href=\"https://drive.google.com/drive/u/0/folders/1fnyYXsYFZFBu2904YFejfGJ8R8qqVlJB\"><b>Editorials</b></a>\r\n  \r\nAs I conclude this recap, I express my immense gratitude to our SRM#11 problem setting panel:  \r\n  \r\n<b>Setters:</b> Mithil Poojary and Surya Madhavan  \r\n<b>Tester:</b> Rahul Sawantdesai and Ninad Chavan  \r\n<b>Editorialist:</b>: Mithil Poojary  \r\n<b>Statement Verifier:</b> Rahul Sawantdesai and Ninad Chavan  \r\n<b>Poster By:</b> Devin Raina  \r\nAlso I would like to thank Swapnil whose efforts allowed execution of the contest with ease.  \r\n\r\nAnd the entire <a href=\"http://arena.siesgst.ac.in/developers\">SIESGSTarena team</a> for being such a beautiful community and encouraging college students to participate in our contests by showing constant efforts.  \r\n  \r\nDo let us know your thoughts on the SRM11 in the comments below. Plus, don’t forget to practice your problem solving skills and participate in the next contest. Until next time, keep practising!","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-08-25T17:23:33.538Z"},"updatedAt":{"$date":"2019-10-07T12:21:40.564Z"},"__v":0},{"_id":{"$oid":"5d7a5583b112e300220a44cf"},"tags":["SRM12"," Inception"],"title":"Single Round Match #12","content":"Greetings to everyone and welcome to the twelfth single round match. I, Aditya Parthasarathy, am the problem setter for the same.\r\n\r\nThe contest will start on 15th January 2019 (Sunday), at 7:30 PM IST, and will last for 3 hours (will end at 10:30 PM IST). The theme of this contest will be the critically-acclaimed, mind-bending masterpiece; the movie <strong>'Inception'</strong>.  A must-watch movie if you ask me. The problem statements are roughly based on the plot of the movie.\r\n\r\nThere will be 3 problems of varying difficulty of 100-300-200 points respectively. The penalty due to WA/CE/RTE/TLE solutions for problem will be applicable only after getting an AC solution. Scoreboard is updated with ICPC style of rankings where users solving more problems and earliest will be at the top. Time penalty of 20 minutes for each unsuccessful attempt will be the difference factor.\r\n\r\nWe do encourage referencing of online resources in case of any difficulty but any form of plagiarism will be met by strict action. The editorial and solutions will be uploaded after the contest has ended.\r\n\r\nSpecial thanks to Rahul Sawantdesai for giving me the opportunity to set the problems and helping me testing the same.\r\n\r\nFeel free to contact me or anyone in the CodeChef Campus Chapter team if any there's any kind of discrepancy found in the problem statements.\r\n\r\nGodspeed programmers!","userId":{"$oid":"5b6c6860746b5e0020a32aa7"},"createdAt":{"$date":"2019-09-12T14:26:11.994Z"},"updatedAt":{"$date":"2019-10-07T12:22:00.777Z"},"__v":0},{"_id":{"$oid":"5d7cd89322a6ee0022e23265"},"tags":["BUG4EVER","september","codechef","intercollege","SIESGSTarena","B4E2019"],"title":"Invitation to the BUG4EVER 2019","content":"<i>Not all bite of a bug leads to pain, some end up becoming a superpower!</i>\r\n\r\nHello Coders!\r\n\r\nI, on behalf of the CodeChef Chapter at the SIES Graduate School of Technology, Nerul, would gladly welcome you all to the fourth iteration of BUG4EVER!\r\n\r\n<b>BUG4EVER</b> is an annual programming contest which is being held for the fourth time, all due to the <b>rise of competitive programmers at SIESGST and the motivation they provide to this Chapter</b>.\r\n\r\n<b>BUG4EVER</b> was started in <i>September 2016</i>, to bring in the awareness of Competitive programming and to inculcate Coding Culture within SIESGST. It is an <b>intercollege</b> event, where students from different colleges can participate in this contest as a team of two.\r\n\r\n<b>Schedule:</b>\r\n\r\n<b>Qualifiers:</b>\r\n\r\nStart time:- 29 September - 00:00 IST\r\n\r\nEnd time:- 02 October - 23:59 IST\r\n\r\nContest Platform: CodeChef\r\n\r\n<b>Onsite Finals :</b>\r\n\r\nDate: 5 October\r\n\r\nContest Platform: CodeChef\r\n\r\nVenue: SIES Graduate School of Technology, Nerul, Navi Mumbai, 400 706\r\n\r\n<b>NOTE:</b> \r\nYou need to register for this contest as it will be a closed contest. Instructions for Registration and Payment is given in the Official Page.\r\n\r\n<b>Registration </b>:\r\n\r\nFee:- 80 Rs (for a team of two)\r\n\r\n<b>Official Page</b>: http://arena.siesgst.ac.in/bug4ever\r\n\r\n<b>Top 10 teams selected from Qualifier round will participate in the finals.\r\nPrizes Worth Rs. 5,000 and more are to be won. Goodies and Certificates will be given to the Top 20 onsite finalists!</b>\r\n\r\nCan’t wait to see you all solve this <b>Bug</b> and win huge! See you on the scoreboard!\r\n\r\n<b>Godspeed!</b>\r\n","userId":{"$oid":"5b6e6f112e29b100208b2e14"},"createdAt":{"$date":"2019-09-14T12:09:55.6Z"},"updatedAt":{"$date":"2019-10-07T12:27:27.231Z"},"__v":0},{"_id":{"$oid":"5d7e70a745059a00221537ed"},"tags":["SRM12"," report"],"title":"SRM #12 -- Report","content":"<p>Congratulations participants! Thank you for participating in SRM12. I hope you guys had fun!</p><br>\r\n\r\nThe top 5 coders of SRM12 are:\r\n\r\n<ol>\r\n  <li>Mithil Kiran Poojary</li>\r\n  <li>Ninad Chavan</li>\r\n  <li>Barath Suresh Nadar</li>\r\n  <li>Vipul Singh Raghuvanshi</li>\r\n  <li>Sonal Arjun Kuchekar</li>\r\n</ol>\r\n\r\n<p>\r\n  Editorials: <a href=\"https://drive.google.com/drive/folders/1n6P7_YFyfriEta3D6GTxanFsJSzwNf3o?usp=sharing\">Click Me!</a>\r\n</p>\r\n\r\n<p>\r\n  Codes: <a href=\"https://drive.google.com/drive/folders/1EoVvFStBrE5oEecWTKYDo--ZPnmg4Q29?usp=sharing\">Click Me!</a>\r\n</p>\r\n\r\n<p>\r\n  Note: Please use the siesgst email id to access the aforementioned codes and editorials.\r\n</p>","userId":{"$oid":"5b6c6860746b5e0020a32aa7"},"createdAt":{"$date":"2019-09-15T17:11:03.248Z"},"updatedAt":{"$date":"2019-10-07T12:21:50.144Z"},"__v":0},{"_id":{"$oid":"5d9a227f3f225d00229e984e"},"tags":["BUG4EVER"],"title":"My Experience - BUG4EVER 2019","content":"BUG4EVER 2019 - The contest I was waiting for since the time I participated last year. I had participated with Barath in 2018. We had qualified to the finals, but did very bad in the finals. It was all okay, we had learnt a lot, understood our weak points as a team, and promised to just get better with time.  \r\n  \r\nThe wait was over, the contest was finally here. We registered our team, with the name \"Soapsandcars\", all excited. The qualifiers was live. We managed to the first 7 questions pretty easily, like all other finalists. The last one was a graph problem. We managed to get 30 points on that, and secured 3rd rank. Hence we qualified, we were glad we did. Equally happy, excited and nervous for the finals.  \r\n  \r\nFinally, it was the day. The day we had been waiting for an year. BUG4EVER finals. The environment felt amazing, its rare to have all smart people sharing same interest under one roof, especially due to heavy college schedule. But it was made possible. Our hearts racing as the timer ticked its way to 0. Eyes on the screen, fingers crossed. The list filled with the 6 questions. We went through all the questions, marking at least 3 of them as \"doable\". We were confident.   \r\n  \r\nTime was up. We scored a 100 points. We were disappointed in self, but we had tried our best!  \r\n  \r\nMy take away from this contest would be : \r\nTake ample rest before the contest day.  \r\nDon't overthink during the contest.  \r\nDon't stress out. Be calm.  Just like in any other contest you have appeared previously, ofc if you've practiced here at arena!\r\nAnd finally, understand that some things aren't in our control. You did your best. :D  \r\n  \r\nAll the best guys, hope to see you next time! :D","userId":{"$oid":"5b6dcf5ce21df60020be63c4"},"createdAt":{"$date":"2019-10-06T17:21:03.608Z"},"updatedAt":{"$date":"2019-11-17T13:04:18.367Z"},"__v":0},{"_id":{"$oid":"5dd04e018598060022441e73"},"tags":["CompetitiveCoding","LevelingUp","Experience"],"title":"2 years into Competitive Coding","content":"<img src=\"https://miro.medium.com/max/1280/1*g3lz2Mg7R8vzstmZY6dB_A.jpeg\"  width=\"500\"/>\r\n\r\nI’ve been coding for over 6 years now, it has become second nature. Learning new languages, new UI’s, easier ways to implement things, that’s what I always look for. As an undergraduate , I was introduced to competitive coding, when I joined the Codechef campus chapter of my college, and took up the role of the Operations manager. Safe to say, I’ve never been able to look at coding the same way ever since. To those who still haven’t looked into competitive coding much, this might sound a bit wild, but coding can truely be a competitive sport. No matter the language, no matter the approach, what matters in this game is the output. The faster you get the perfect output, using the least amount of memory and the least number of lines of code, the better you score. Unlike teaching traditional coding, this branch of coding, forces you to understand the algorithm flow first and then find the language, you are most comfortable in to start implementing the algorithm.\r\n\r\n<img src=\"https://miro.medium.com/max/1152/1*CG5l-LQXi3N3OvYh5SffPg.jpeg\"  width=\"500\"/>\r\n\r\nWorking with the IEEE chapter of SIESGST as the technical head, I was given an opportunity, to participate in IEEE Xtreme which is a global challenge in which teams of IEEE Student members compete in a 24-hour time span against each other to solve a set of programming problems. This was my first experience in such a coding environment and It is totally different from anything I have had previously been a part of. Heated debates on what the best way to solve a problem could be, Xtreme joy on getting an “answer accepted” screen , casual talks during random self assigned breaks all made the experience great and memorable. Being able to compete at such high ranks, with such strongly built teams, brings a whole new level of excitement as I look forward to leveling up and coming back even stronger and more prepared next year. Until then, let’s keep coding!\r\n\r\n<img src=\"https://miro.medium.com/max/1280/1*pZ4yMwgUPiURSEvqixJj7A.jpeg\"  width=\"500\"/>","userId":{"$oid":"5b606d47e228ec0020a1fcf1"},"createdAt":{"$date":"2019-11-16T19:29:05.736Z"},"updatedAt":{"$date":"2019-11-16T20:59:42.573Z"},"__v":0}]
